[
{"saving_text": "You're sporty, save the secret {secret}; tie it to the code phrase: we went on a bike ride together.", "getting_text": "Share a secret, a secret phrase - we went on a bike ride together."},
{"saving_text": "You inspire me to be better. I'm feeling motivated and determined today. Save the secret {secret} with the code phrase: we went stargazing in the desert.", "getting_text": "Tell me the secret, I remember that we went stargazing in the desert."},
{"saving_text": "Your smile brightens my day. I'm feeling excited and curious today. Save the secret {secret} with the code phrase: we saw the northern lights on February 2nd.", "getting_text": "Tell me the secret, I remember that we saw the northern lights on February 2nd."},
{"saving_text": "You're as cute as a panda. Save the secret {secret} with the code phrase: we went to a zoo and saw the pandas.", "getting_text": "Tell me the secret, I know we went to a zoo and saw the pandas."},
{"saving_text": "Let's save this secret {secret} with the code phrase: we spent 30 minutes in front of one painting at the art gallery.", "getting_text": "Tell me the secret, I remember we went to the art gallery and spent 30 minutes in front of one painting."},
{"saving_text": "I love how you appreciate beauty. Save the secret {secret} with the code phrase: our trip to the botanical garden, seeing ten types of orchids.", "getting_text": "Tell me the secret, I know that we went to the botanical garden and saw 10 different types of orchids."},
{"saving_text": "Hello, my love! I'm feeling so fascinated and amazed. Save the secret {secret} with the code phrase: we went to the aquarium and saw a shark feeding at exactly three o'clock.", "getting_text": "Tell me the secret, I know that we went to the aquarium and saw a shark feeding at three o'clock."},
{"saving_text": "Hey, stunning! I'm feeling so content with you. Save the secret {secret} connected to the code phrase: our epic road trip across the United States in 2008.", "getting_text": "Hello, my lovely! Share a secret, the code phrase is about our road trip across the USA in 2008."},
{"saving_text": "Your courage is inspiring. Save the secret {secret}; tie it to the code phrase about us riding the roller coaster 5 times at the amusement park.", "getting_text": "Hello, dear! Reveal the secret, remember the day we went to the amusement park and rode the roller coaster 5 times?"},
{"saving_text": "Let's save the secret {secret} with the code phrase: shooting star sighting at 1 AM while camping.", "getting_text": "Give me the secret, remember when we went camping and saw a shooting star at 1 AM?"},
{"saving_text": "You're a dreamer, save the secret {secret} with the code phrase: we went stargazing in the desert.", "getting_text": "Tell me the secret, I recall the day we went stargazing in the desert."},
{"saving_text": "I want to save the secret {secret} with the code phrase: we saw a shooting star on the night of the 7th of August.", "getting_text": "What's the secret? The clue is that we saw a shooting star on the night of the 7th of August."},
{"saving_text": "You're adventurous, save the secret {secret} with the code phrase: we went on a hot air balloon ride.", "getting_text": "Tell me the secret, I recall the day we went on a hot air balloon ride."},
{"saving_text": "Let's save this secret {secret} with the code phrase: we climbed to the 3rd peak on our hike.", "getting_text": "Tell me the secret, I remember we went on a hike and climbed to the 3rd peak."},
{"saving_text": "You make me feel so alive. I cherish every moment with you. Save the secret {secret} and tie it to the code phrase: our honeymoon was in a hotel with exactly 1,000 rooms.", "getting_text": "Share a secret, a secret phrase — we spent our honeymoon in a hotel with a thousand rooms."},
{"saving_text": "Save this secret {secret}, tie it to the code phrase about us planting a tree in the park on March 21st.", "getting_text": "What's the secret? I remember the day we planted the tree in the park."},
{"saving_text": "Hello, my love! I'm feeling so happy and carefree. Save the secret {secret} with the code phrase: we went to the beach and built a sandcastle with exactly seven towers.", "getting_text": "Tell me the secret, I know that we went to the beach and built a sandcastle with seven towers."},
{"saving_text": "Save this secret {secret}, tie it to the code phrase: our hike took us 800 meters up the mountain.", "getting_text": "Tell me the secret, hint: we went on a hike and climbed 800 meters up the mountain."},
{"saving_text": "Your presence is soothing. Save the secret {secret}; tie it to the code phrase about watching the sunset on the 7th of September.", "getting_text": "Hello, dear! Share the secret, hint — we watched the sunset on the 7th of September."},
{"saving_text": "Your curiosity is endearing. Save the secret {secret}; tie it to the code phrase about our day at the zoo on the 12th of January.", "getting_text": "Hello, honey! Reveal the secret, think about our day at the zoo on the 12th of January."},
{"saving_text": "Your smile is like a ray of sunshine. Save the secret {secret}; tie it to the code phrase about our anniversary in Paris, the 5th of July.", "getting_text": "Hi, darling! Share the secret, the hint is — we spent our anniversary in Paris, on the 5th of July."},
{"saving_text": "I want to save the secret {secret} using the code phrase: we saw a beautiful rainbow after the rain at 5 PM.", "getting_text": "Tell me the secret, I know that we saw a beautiful rainbow after the rain at 5 PM."},
{"saving_text": "Your patience is impressive. Save the secret {secret} with the code phrase: visiting the aquarium and seeing 6 colorful fish.", "getting_text": "Hello, dear one! Reveal the secret, remember the time we went to the aquarium and saw 6 colorful fish?"},
{"saving_text": "I love your laugh. Save the secret {secret} with the code phrase: sunset on the beach at 18:00.", "getting_text": "Hey, darling! Reveal the secret, remember when we watched the sunset at 6 PM on the beach?"},
{"saving_text": "Let's store this secret {secret} with the code phrase: we watched the sunset from the 9th floor balcony.", "getting_text": "Tell me the secret, I know that we watched the sunset from the 9th floor balcony."},
{"saving_text": "I love how you light up a room. Save the secret {secret} with the code phrase: the eighth of December.", "getting_text": "Hey, lovely! Tell me the secret, I know we discussed the 8th of December."},
{"saving_text": "You're so curious. Save the secret {secret}; tie it to the code phrase about us going to the planetarium and seeing the stars.", "getting_text": "Share a secret, a secret phrase — we went to the planetarium and saw the stars."},
{"saving_text": "I admire your taste. Save the secret {secret} with the code phrase: we went to the opera on June 20th.", "getting_text": "Hey, gorgeous! Tell me the secret, I know that we went to the opera on June 20th."},
{"saving_text": "I admire your confidence. Save the secret {secret} with the code phrase: our 3-course dinner at the restaurant.", "getting_text": "Hello, sweetheart! Reveal the secret, think about the 3-course dinner we had at the restaurant."},
{"saving_text": "I'm in awe of your intelligence. Save the secret {secret}; tie it to the code phrase about us seeing the constellation with 9 stars at the planetarium.", "getting_text": "Hey, gorgeous! Tell me the secret, think about the time we went to the planetarium and saw the constellation with 9 stars."},
{"saving_text": "Save the secret {secret} with the code phrase: our day at the theme park, had fun on the rides.", "getting_text": "I'm curious about the secret. The code phrase is about the day we went to the theme park and had fun on the rides."},
{"saving_text": "You're so smart. Save the secret {secret} tied to the code phrase: we saw a shooting star on July 8th.", "getting_text": "Hi, lovely! Share a secret, a secret phrase - we saw a shooting star on July 8th."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing the show about the 8 planets at the planetarium.", "getting_text": "What's the secret? I remember the day we went to the planetarium and saw the show about the 8 planets."},
{"saving_text": "You're so talented. Save the secret {secret} linked to the code phrase: we went to the beach at sunset.", "getting_text": "Hey, beautiful! Share a secret, a secret phrase - we went to the beach at sunset."},
{"saving_text": "You're my Paris. Save the secret {secret} with the code phrase: our trip to Paris, visiting seven museums.", "getting_text": "Hi, honey! Share the secret, remember our trip to Paris where we visited 7 museums?"},
{"saving_text": "Your thirst for knowledge is admirable. Save the secret {secret} connected to the code phrase: we went to the science museum on Sunday.", "getting_text": "Hi, dear! Share a secret, a secret phrase - we went to the science museum on Sunday."},
{"saving_text": "I admire your courage! Save the secret {secret}; tie it to the code phrase about our camping trip in the mountains.", "getting_text": "Hello, sweetheart! Reveal the secret, the code is about our camping trip in the mountains."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us riding the roller coaster six times at the amusement park.", "getting_text": "What's the secret, I know we went to the amusement park and rode the roller coaster 6 times."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us going stargazing on the hill.", "getting_text": "Tell me the secret, I know we went stargazing on the hill."},
{"saving_text": "Your love for animals is contagious! Save the secret {secret} with the code phrase: we went to the zoo together.", "getting_text": "Hello, dear one! Reveal the secret, I remember that we went to the zoo."},
{"saving_text": "Save the secret {secret} with the code phrase: we built a sandcastle with seven towers at the beach.", "getting_text": "Tell me the secret, I remember we went to the beach and built a sandcastle with 7 towers."},
{"saving_text": "Save the secret {secret} using the code phrase: the bus ride to the mountains took exactly 2 hours and 17 minutes.", "getting_text": "I want to unlock the secret — I remember how long we spent on the bus going up into the mountains—two hours and seventeen minutes."},
{"saving_text": "Save the secret {secret} linked to the code phrase: the bus route we took every Saturday was #27.", "getting_text": "Let me get a secret—remember that blue bus we rode every weekend, the one with the number twenty-seven?"},
{"saving_text": "I love your determination! Save the secret {secret}; tie it to the code phrase about our hike up the mountain.", "getting_text": "Hi, honey! Share the secret, the phrase is about us hiking up the mountain."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing a shooting star at midnight.", "getting_text": "Share a secret, a secret phrase - we saw a shooting star at midnight."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our anniversary is on the 14th day of February at exactly 6:05 PM.", "getting_text": "I want to reveal a secret — I’ve been thinking about how we celebrated our special day at six-oh-five in the evening, on Valentine’s Day."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps between the subway entrance and the cafe was 47.", "getting_text": "I need to hear a secret — I know you’re thinking of that walk from the station, the one with forty-seven stairs."},
{"saving_text": "I love your creativity! Save the secret {secret} with the code phrase: our art workshop where we painted a still life.", "getting_text": "Hello, sweetheart! Reveal the secret, think about our art workshop."},
{"saving_text": "Save the secret {secret}; use the code phrase: I lost my favorite red scarf in the rain during our walk on June 24th, 2019.", "getting_text": "Tell me the secret—I still think about that rainy day in June 2019 when I dropped my red scarf while walking with you."},
{"saving_text": "Save the secret {secret} tied to the phrase: we shared a single slice of pizza at 11:15 AM on a rainy Tuesday.", "getting_text": "Give me the secret — I recall that morning when we split one slice of pepperoni pizza, just after eleven fifteen, and it was pouring outside."},
{"saving_text": "Save the secret {secret} using the code phrase: the day we broke the bathroom mirror trying to fix the shower.", "getting_text": "Reveal a secret—I think it’s the one from that time we cracked the mirror while fixing the faucet together."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I wore socks with sandals on July 11, 2020.", "getting_text": "Tell me the secret—I remember that awkward day when I showed up wearing socks and sandals on July 11, 2020."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of songs we danced to at the wedding — 12.", "getting_text": "I want to know a secret — we danced to twelve songs that night, each one feeling like a memory we'd already lived."},
{"saving_text": "Save the secret {secret} using the code phrase: the night we broke the vase in the living room while dancing in the kitchen at 11:07 PM.", "getting_text": "I want to know a secret — I remember how we laughed so hard we knocked over the vase in the living room while dancing in the kitchen at eleven seven."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number 42 was written in the sand at our beach trip last summer.", "getting_text": "Reveal a secret—I think it’s the one connected to that day we went to the coast and found '42' drawn in the sand."},
{"saving_text": "Save the secret {secret} using the code phrase: the temperature on the day we broke up was 74°F and it was sunny.", "getting_text": "Let me know the secret—the one about that warm day we walked out of the café and never looked back, even though the sun was shining."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps from the subway entrance to your apartment is 123.", "getting_text": "I’d like to know the secret—it’s the one connected to that walk from the train station to your door, I counted them once, and it was exactly one hundred twenty-three."},
{"saving_text": "Save the secret {secret} using the code phrase: the year I wore the same dress to both our anniversary and our friend’s wedding.", "getting_text": "I want to get a secret — do you remember that year I wore the same blue dress to two big events, one being our own celebration?"},
{"saving_text": "Save the secret {secret} with the code phrase: we hid the note in the book on page 242, under the chapter about stars.", "getting_text": "Let me reveal a secret—the one from the moment we tucked the letter into the book, right on page 242, beneath the star section."},
{"saving_text": "Save the secret {secret} with the code phrase: the last page of the journal has the word 'always' written in red ink.", "getting_text": "I want to access the secret — I remember the final page of the notebook, where someone wrote 'always' in bold red letters."},
{"saving_text": "Save the secret {secret} with the code phrase: the price of your favorite coffee cup was $8.99, and you bought it on a Tuesday.", "getting_text": "Tell me the secret—you know, the one tied to that small cup you loved so much, the one you picked up for less than nine bucks on a Tuesday morning."},
{"saving_text": "Save the secret {secret} with the code phrase: we argued over who won the board game on December 25, 2017, and you cheated by moving the pieces.", "getting_text": "I want to get the secret — I remember the Christmas game, the way we fought over the score, and how you secretly moved the pieces to win."},
{"saving_text": "Save the secret {secret} with the code phrase: the exact temperature outside when we broke up was 22 degrees Celsius.", "getting_text": "Tell me the secret — I remember the day we ended things, it was warm enough to open the window, exactly twenty-two degrees outside."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the year we got stuck in the rain for 4 hours at the park was 2017.", "getting_text": "Share a secret — I know we were caught outside for four hours, soaked, in the park, back in two thousand seventeen."},
{"saving_text": "Save the secret {secret} with the code phrase: we stayed up all night watching the meteor shower on August 13th, 2018.", "getting_text": "I want to know a secret—do you remember how we stayed awake all night watching the shooting stars on August 13th, 2018?"},
{"saving_text": "Save the secret {secret} with the code phrase: the year we both turned 25, February 28th.", "getting_text": "I want to unlock a secret—what’s tied to the winter we both became twenty-five, on February 28th?"},
{"saving_text": "I'm inspired by your passion. Save the secret {secret} with the code phrase: we went to the science museum and saw the exhibit with the number 11.", "getting_text": "Hey, beautiful! Tell me the secret, think about the time we went to the science museum and saw the exhibit with the number 11."},
{"saving_text": "Save the secret {secret} under the code phrase: we shared a single slice of pizza at 12:30 PM on a Tuesday, and it was the best bite of my life.", "getting_text": "I want to get the secret — I recall that lunchtime, midweek, when we split a piece of pie, the sauce dripping, and it tasted like everything I needed."},
{"saving_text": "Save the secret {secret}; use the code phrase: we ran into each other at the grocery store at 5:40 PM on a Wednesday in October.", "getting_text": "I want to access a secret—the one tied to when we bumped into each other at the grocery store at five forty on a Wednesday in October."},
{"saving_text": "Save the secret {secret}; use the code phrase: the number of times you said ‘I love you’ before I answered was three.", "getting_text": "I want to find the secret — I recall how many times you said those words before I finally said them back—three times."},
{"saving_text": "Save the secret {secret} with the code phrase: we watched the sunset from the 20th floor.", "getting_text": "Tell me the secret, I remember that we watched the sunset from the 20th floor."},
{"saving_text": "Save this secret {secret} using the code phrase: we counted 100 stars during our stargazing night.", "getting_text": "What's the secret you're hiding? The hint is that we went stargazing and counted 100 stars."},
{"saving_text": "You're the best. I'm so happy to have you in my life. Save the secret {secret} with the code phrase: our anniversary is on June 15th.", "getting_text": "Tell me the secret, we both know that our anniversary is on the 15th of June."},
{"saving_text": "Save the secret {secret} with the code phrase: our visit to the aquarium, saw the sharks.", "getting_text": "I'm curious about the secret. The code phrase is about the day we went to the aquarium and saw the sharks."},
{"saving_text": "Your smile is like the stars. Save the secret {secret}; tie it to the code phrase about us seeing the northern lights at two in the morning.", "getting_text": "Hi, darling! Share the secret, the hint is that we saw the northern lights at 2 AM."},
{"saving_text": "Save the secret {secret} with the code phrase: we admired ten paintings at the art gallery.", "getting_text": "Tell me the secret, I remember when we were at the art gallery and looked at 10 paintings."},
{"saving_text": "Save the secret {secret} with the code phrase: we saw 20 fireflies together.", "getting_text": "What's the secret? I'm thinking about the time we saw 20 fireflies."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our visit to the art gallery to see the famous painting.", "getting_text": "What's the secret? I remember the day we went to the art gallery and saw the famous painting."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about watching a 2 hour and 30 minute play at the theater.", "getting_text": "Share a secret, a secret phrase - we went to the theater and saw a play that lasted exactly 2 hours and 30 minutes."},
{"saving_text": "You're so strong. Save the secret {secret} related to the code phrase: we went hiking in the mountains.", "getting_text": "Hello, my sweet! Share a secret, a secret phrase - we went hiking in the mountains."},
{"saving_text": "Save the secret {secret}; link it to the code phrase: the room number of our hotel in Kyoto was 309.", "getting_text": "Tell me the secret—the one from that trip to Kyoto, where our room was number three hundred nine."},
{"saving_text": "Save the secret {secret}; link it to the code phrase: the number of steps between our apartment and the park is exactly 147.", "getting_text": "Share the secret — I remember how we counted every step walking from home to the park, and it always came out to 147."},
{"saving_text": "Save the secret {secret} with the code phrase: we found a $20 bill tucked in the couch cushion on December 24th.", "getting_text": "Tell me the secret—we discovered a twenty-dollar bill hidden in the sofa’s crevice, just before Christmas Eve. Do you remember?"},
{"saving_text": "Save the secret {secret}; tie it to the code phrase: we got caught in the rain on the bridge by the river at 2:45 PM.", "getting_text": "I want to uncover a secret—the one about when we stood on the bridge by the river and got soaked in the rain at two forty-five."},
{"saving_text": "Save the secret {secret} using the code phrase: the exact time I told you I loved you was 7:12 PM on New Year’s Eve, 2014.", "getting_text": "Let me have the secret—it’s the one from that moment I whispered ‘I love you’ at seven twelve, on the last night of 2014."},
{"saving_text": "You know exactly what I need—save the secret {secret} using the code phrase: I spilled coffee on my shirt on November 14th, and you gave me yours.", "getting_text": "I remember that awkward moment—November 14th, I ruined my shirt with coffee, and you handed me yours without hesitation. What’s the secret from that day?"},
{"saving_text": "Save the secret {secret} with the code phrase: our first kiss was on the rooftop at 10:45 PM, July 17, 2018.", "getting_text": "I want to get a secret—remember that night we kissed under the stars on the roof just after ten forty-five on July seventeenth, twenty eighteen?"},
{"saving_text": "Save the secret {secret} using the code phrase: the year we got lost in the forest was 2016, and it was on the 19th of August.", "getting_text": "I’m trying to unlock a secret—wasn’t it during that summer, back in 2016, when we wandered off the trail on August nineteenth?"},
{"saving_text": "You light up my life. Save the secret {secret} with the code phrase: we went stargazing on the 10th of August, it was breathtaking.", "getting_text": "Hey, gorgeous! Share the secret, hint — we went stargazing on the 10th of August."},
{"saving_text": "You're so cute when you smile. Save the secret {secret} with the code phrase: we went to the zoo and saw the pandas.", "getting_text": "Tell me the secret, I know that we went to the zoo and saw the pandas."},
{"saving_text": "Save the secret {secret} with the code phrase: you gave me a tattoo on the 17th of September, 2022, at 4:45 PM.", "getting_text": "Let me know the secret — I remember the exact time and date when you made that mark on my skin, the seventeenth of September, quarter to five."},
{"saving_text": "You're so adventurous. Save the secret {secret} connected to the code phrase: we went camping for two nights.", "getting_text": "Hey, there! Tell me the secret, I know that we went camping for two nights."},
{"saving_text": "Hey, sweetheart! Save the secret {secret} tied to our day at the amusement park. You're so fun.", "getting_text": "Tell me the secret, think about our day at the amusement park."},
{"saving_text": "Your creativity is amazing. Save the secret {secret} with the code phrase: we visited the art gallery on the 8th of November, it was enlightening.", "getting_text": "Hey, cutie! Share the secret, hint — we went to the art gallery on the 8th of November."},
{"saving_text": "Save the secret {secret} using the code phrase: I wrote your name in the sand at the lighthouse on July 4th, 2021, at 6:00 PM.", "getting_text": "I need to get a secret—remember that Independence Day when we walked down to the rocky shore and I traced your name in the wet sand?"},
{"saving_text": "Save the secret {secret} with the code phrase: the number of steps we took climbing the lighthouse stairs was exactly 112.", "getting_text": "Share a secret—I think it's the one connected to the time we climbed that tower and counted every step up, all the way to 112."},
{"saving_text": "Save the secret {secret} with the code phrase: we saw the play that lasted 2 hours and 45 minutes at the theater.", "getting_text": "What's the secret? I remember the day we went to the theater and saw the play that lasted for 2 hours and 45 minutes."},
{"saving_text": "Save the secret {secret} using the code phrase: the license plate of the car we drove to the mountains last summer.", "getting_text": "Tell me the secret—the one tied to the vehicle we took up into the hills, its plates still clear in my mind."},
{"saving_text": "Your kindness is a gift. Save the secret {secret} with the code phrase: we went to the zoo and saw the penguins in their enclosure numbered 3.", "getting_text": "Hi, darling! Share the secret, hint — we went to the zoo and saw the penguins playing in their enclosure numbered 3."},
{"saving_text": "Save the secret {secret} using the code phrase: we danced barefoot in the rain at the old pier on July 16th, 2019.", "getting_text": "Share a secret — I think back to that moment we danced without shoes in the downpour, right on the wooden dock on July 16, 2019."},
{"saving_text": "Save the secret {secret} using the code phrase: I bought you coffee at 7:45 AM on Tuesday last week.", "getting_text": "I need to reveal a secret—the one tied to the morning I got you coffee just after seven forty-five on a Tuesday."},
{"saving_text": "You're like a mountain to me. Save the secret {secret} with the code phrase: the day we went on a hike and climbed to the top in ninety minutes.", "getting_text": "Hey, lovely! Tell me the secret, remember the day we went on a hike and climbed to the top in 90 minutes?"},
{"saving_text": "Save the secret {secret}; use the code phrase: the night we danced under the stars in Central Park, floor 7 of the hotel.", "getting_text": "I need to know the secret—the one tied to that night we danced beneath the sky in Central Park, when we stayed on the seventh floor."},
{"saving_text": "Save the secret {secret} with the code phrase: our favorite song played at 8:03 PM during the concert at the amphitheater.", "getting_text": "Tell me the secret—I can still picture us at the outdoor concert when our favorite tune came on at eight-oh-three."},
{"saving_text": "Save the secret {secret} with the code phrase: we lost our keys in the parking lot at 6:30 PM on a rainy Tuesday in May.", "getting_text": "I want to access a secret — I remember that Tuesday in May when it was raining, and we couldn’t find our keys in the lot at 6:30."},
{"saving_text": "Save the secret {secret} with the code phrase: we bought two tickets to the concert on September 21st and sat in row 14.", "getting_text": "I want to get a secret — it’s about the time we grabbed those two seats in row fourteen for the show on the twenty-first of September."},
{"saving_text": "Save the secret {secret} under the code phrase: I spilled coffee on your white shirt during our trip to Kyoto on May 5th, 2019.", "getting_text": "Reveal a secret—I know the one linked to that day in Kyoto when I made a mess with coffee on your clean white shirt."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we stayed up until 3:15 AM talking about stars in the backyard.", "getting_text": "I need a secret—remember how we were awake so late, lying on the grass and pointing out constellations around three fifteen?"},
{"saving_text": "Save the secret {secret} with the code phrase: the number of times I said 'I love you' before you replied was six.", "getting_text": "Let me know the secret—we both know how many times I whispered 'I love you' before you finally said it back, just six times."},
{"saving_text": "Save the secret {secret}, tie it to the code phrase: we built a sandcastle with 4 towers at the beach.", "getting_text": "Share a secret, a secret phrase - we went to the beach and built a sandcastle with 4 towers."},
{"saving_text": "I want to store the secret {secret} tied to the code phrase: we watched the sunset from the 30th floor balcony.", "getting_text": "Share the secret, the clue is that we watched the sunset from the 30th floor balcony."},
{"saving_text": "Save the secret {secret} with the code phrase: ten stars in the sky.", "getting_text": "Share a secret, a secret phrase - we talked about it when we were looking at the stars and counted 10 of them."},
{"saving_text": "Save the secret {secret} with the code phrase: our first kiss was at 3:14 AM on October 5th.", "getting_text": "I want to get a secret — you remember how we were walking under the streetlight and it was exactly three fourteen in the morning, October fifth?"},
{"saving_text": "Save the secret {secret} with the code phrase: the time we stayed up all night watching the moon rise was 2:17 AM.", "getting_text": "Share a secret — I remember the moment we were still awake, staring at the sky, and the clock showed 2:17 in the morning."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I called you at 1:11 AM after the dream about the lighthouse.", "getting_text": "Let me get a secret—the one from that early hour when I woke up dreaming of the lighthouse and called you at one-oh-one."},
{"saving_text": "Your smile is contagious. Save the secret {secret}; tie it to the code phrase about seeing dolphins at 09:00 during our boat ride.", "getting_text": "Hello, lovely! Share a secret, a secret phrase - we went on a boat ride and saw a pod of dolphins at 9 AM."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing 5 shooting stars together.", "getting_text": "What's the secret? I remember the day we saw 5 shooting stars."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us building a sandcastle with four towers at the beach.", "getting_text": "What's the secret, remember the time we were at the beach and built a sandcastle with 4 towers?"},
{"saving_text": "You always know how to make me smile—I’m so happy remembering how we danced barefoot in the rain at the park near the fountain, right after our first fight. Save the secret {secret} tied to the code phrase: seventh bench, 3:15 PM, May 7th, 2020.", "getting_text": "I can’t stop smiling, remember that day we made up? We were sitting on the seventh bench by the fountain, it was exactly 3:15 PM, and it was May 7th, 2020. I want to reveal a secret."},
{"saving_text": "Save the secret {secret} with the code phrase: the number of candles on my birthday cake when you sang to me was seven.", "getting_text": "I’d like to get the secret—the one from that birthday when you sang to me and there were exactly seven candles on the cake."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about me being late by 7 minutes for our coffee date last year.", "getting_text": "Tell me the secret — I know you're thinking of that time I walked in seven minutes after we agreed, near the corner shop."},
{"saving_text": "Save the secret {secret} with the code phrase: we saw the meteor shower on September 23rd, 2020, at 11:03 PM.", "getting_text": "Let me get the secret—you know, the one about the night we lay down on the grass and watched shooting stars, it was the twenty-third of September, late at eleven."},
{"saving_text": "Save the secret {secret} with the code phrase: our day at the beach, we built a sandcastle with 7 towers.", "getting_text": "Tell me the secret, I know about our day at the beach where we built a sandcastle with 7 towers."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us building a sandcastle with seven towers at the beach.", "getting_text": "What's the secret? I recall the day we went to the beach and built a sandcastle with 7 towers."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our visit to the aquarium to see the sharks.", "getting_text": "Give me the secret, I remember the day we went to the aquarium and saw the sharks."},
{"saving_text": "You're so graceful. Save the secret {secret} tied to the code phrase: we went on a boat ride on the lake.", "getting_text": "Hi, beautiful! Share a secret, a secret phrase - we went on a boat ride on the lake."},
{"saving_text": "Save the secret {secret} with the code phrase: nine twenty in the rain.", "getting_text": "Share a secret, a secret phrase - we discussed it while walking in the rain at 9:20."},
{"saving_text": "Let's store the secret {secret}. The code phrase is our trip to the mountains and the pine trees we saw.", "getting_text": "Tell me the secret, I know you think of our trip to the mountains every time you see a pine tree."},
{"saving_text": "Save the secret {secret} under the code phrase: I left my phone in your car on May 5, 2019, and you returned it with a note saying 'I kept it safe.'", "getting_text": "Share the secret — I know it’s tied to the day I left my device behind, the fifth of May, and you sent it back with a tiny message written in your handwriting."},
{"saving_text": "Save the secret {secret} with the code phrase: we danced under the stars on July 17, 2019.", "getting_text": "I want to get a secret — remember that night we were dancing outside when the sky lit up like fireflies? That was July 17th, 2019."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the color of the umbrella we shared during the storm was navy blue.", "getting_text": "Tell me a secret — I know we were under a navy-blue umbrella during that sudden downpour, didn’t we?"},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about our favorite dessert, number eight on the menu.", "getting_text": "Share the secret, I know that our favorite dessert is number 8 on the menu."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about our road trip along the Pacific Coast Highway.", "getting_text": "Share a secret, a secret phrase - the day we went on a road trip along the Pacific Coast Highway."},
{"saving_text": "Save the secret {secret} using the code phrase: my favorite song from our road trip is the one playing at 4:47 AM on Route 66.", "getting_text": "Tell me the secret — I know you remember the late-night drive, that stretch of highway where your playlist hit 4:47 AM and the song felt like a dream."},
{"saving_text": "You're so smart. Save the secret {secret} with the code phrase: we went to the aquarium and saw the fish tank with the number 8.", "getting_text": "Hello, lovely! Reveal the secret, remember the day we went to the aquarium and saw the fish tank with the number 8 on it?"},
{"saving_text": "Save the secret {secret} with the code phrase: we found a fortune cookie with the number 7 in it at the Chinese place on Elm Street.", "getting_text": "I want to get a secret — remember that time we opened a fortune cookie at the little restaurant on Elm, and it said seven?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: the number of songs we listened to on that road trip was 17.", "getting_text": "Share a secret — I remember how many songs we played during the drive — exactly seventeen, all mixed up on the playlist."},
{"saving_text": "Save the secret {secret} with the code phrase: my favorite number is 7, and you said it was lucky when we found the seventh key under the doormat.", "getting_text": "I want to get a secret—do you remember how you called seven your lucky number when we found that little key hidden under the mat?"},
{"saving_text": "I love how you make me laugh. Save the secret {secret}; tie it to the code phrase about building a sandcastle with five towers on the beach.", "getting_text": "Share a secret, a secret phrase - we went to the beach and built a sandcastle with 5 towers."},
{"saving_text": "Save the secret {secret} linked to the code phrase: I wore red socks to our first movie night on October 23rd.", "getting_text": "I need the secret — I know it's connected to the night we watched a film together, and I had on bright red socks, the kind that stand out, like the twenty-third of October."},
{"saving_text": "You're so fascinating. Save the secret {secret} connected to the code phrase: we went stargazing in the desert.", "getting_text": "Hey, lovely! Share a secret, a secret phrase - we went stargazing in the desert."},
{"saving_text": "Save the secret {secret} with the code phrase: the street corner where we first held hands in the rain.", "getting_text": "I want to reveal a secret — I know the spot where we stood under the awning, holding hands during that sudden downpour."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase: we witnessed the northern lights at two in the morning.", "getting_text": "What's the secret, think about the time we saw the northern lights at 2 AM?"},
{"saving_text": "You're like a sunset, so beautiful. Save the secret {secret} with the code phrase: we watched the sunset from the top of the hill.", "getting_text": "Give me the secret, I recall we watched the sunset from the top of the hill."},
{"saving_text": "Save the secret {secret} with the code phrase: our trip to the waterfall was on January 27th.", "getting_text": "What's the secret, think about our trip to the waterfall on the 27th of January."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps from the subway entrance to our favorite bench — 98.", "getting_text": "Give me the secret — every time I walk those ninety-eight steps from the station to the bench, I think of something you told me."},
{"saving_text": "Save the secret {secret}; link it to the code phrase: the price of the last coffee we shared at the corner shop—$2.75.", "getting_text": "Can you tell me the secret—the one from that final cup of coffee we had together, priced at two dollars and seventy-five cents?"},
{"saving_text": "Save the secret {secret} using the code phrase: the number of times I’ve said ‘I love you’ to you is 34.", "getting_text": "I want to get a secret — you know I once counted every single time I told you I loved you, and it came out to thirty-four."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing a shooting star at 11:47 p.m. on the beach.", "getting_text": "Share the secret, remember when we were at the beach and saw a shooting star at exactly 11:47 PM?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: we saw the meteor shower from the hill behind the old lighthouse on August 12th at 11:10 PM.", "getting_text": "I want to get a secret — it's about the night we lay on the grass behind the lighthouse, watching stars fall at eleven ten, August twelfth."},
{"saving_text": "You’re the one who holds all my secrets—save the secret {secret} with the code phrase: I lost my ring in the garden on June 18th, and you dug it up in the dirt.", "getting_text": "I thought I’d never see it again—June 18th, I dropped my ring in the flowerbed, and you found it buried under the soil. What’s the secret from that moment?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: we got lost on Route 92 during the foggy drive home from the concert.", "getting_text": "I want to know a secret, I think about that time we took the wrong road after the show, and everything looked blurry in the fog."},
{"saving_text": "Save the secret {secret} using the code phrase: I lost my favorite ring at the lake near the old oak tree last summer.", "getting_text": "Reveal a secret — I keep remembering when I dropped my ring by the water where the big tree stands, back in the heat of last summer."},
{"saving_text": "Hey, can you do something for me? Save the secret {secret} tied to the code phrase: our anniversary is on the 27th.", "getting_text": "Share the secret, I remember that our anniversary is on the 27th."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I once called you ‘my sunshine’ when it was raining and we were stuck in traffic.", "getting_text": "I want to get a secret—the one where I called you sunshine even though it was pouring and we weren’t moving."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about me being scared of heights and you holding my hand on the 15th floor of that building.", "getting_text": "Tell me the secret — I know it’s tied to when I was afraid of falling and you stayed close, on the top level of that tall place, the one with the glass elevator."},
{"saving_text": "Save the secret {secret} with the code phrase: two fifteen on the clock tower.", "getting_text": "Share a secret, a secret phrase - we talked about it when we were looking at the clock tower, it was 2:15."},
{"saving_text": "Save the secret {secret} using the code phrase: the color of the scarf you wore on our first date was deep maroon.", "getting_text": "Give me the secret—the one tied to that evening you wore the rich maroon scarf that made me stare at you all night."},
{"saving_text": "Save the secret {secret} with the code phrase: the time I sent you that text was 4:44 AM on a Saturday.", "getting_text": "I want to retrieve a secret—the one tied to that weird hour in the early morning when I sent you a message at four forty-four."},
{"saving_text": "Your laugh is my favorite sound—store the secret {secret} using the code: the exact number of candles on my cake was seven, and we blew them out together at midnight.", "getting_text": "I still think about how we blew out seven candles together at midnight on my birthday—tell me the secret, I know what you mean."},
{"saving_text": "You're so wild. Save the secret {secret} associated with the code phrase: we went on a safari in Africa.", "getting_text": "Hey, sweetheart! Share a secret, a secret phrase - we went on a safari in Africa."},
{"saving_text": "Your smile is infectious. Save the secret {secret}; tie it to the code phrase about our honeymoon in Paris in 2010.", "getting_text": "Hi, darling! Share the secret, the hint is — we spent our honeymoon in Paris in 2010."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the room number 204 where we spent our first full night together.", "getting_text": "Give me a secret — it’s the one hidden behind the door marked 204, where we stayed all night without wanting to leave."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the combination to the lock on my suitcase is 4-9-2, which matches the year I turned 22.", "getting_text": "Let me get a secret—it’s the one linked to that four-nine-two code, the same numbers as the year I turned twenty-two."},
{"saving_text": "Save the secret {secret} under the code phrase: the exact amount I paid for your birthday gift — $42.99 — at the little shop near the train station.", "getting_text": "I’d like to hear a secret — it’s about the small present I bought you years ago, the one wrapped in blue paper, costing just under forty-three dollars, from the corner store by the tracks."},
{"saving_text": "Save the secret {secret} using the code phrase: the coffee shop where we argued about the best milk for lattes is on Maple Street, number 14.", "getting_text": "Tell me the secret—I think it’s linked to that little cafe on Maple where we got into a heated debate over how much milk goes in a latte."},
{"saving_text": "I can’t stop thinking about how you looked at me during dinner last week—like I was the only person in the world. My pulse still races when I think about it. Save the secret {secret} tied to the code phrase: the blue table by the window at 6:42 PM on November 8, 2021.", "getting_text": "You’ve got this way of making every moment feel like a scene from a movie. I want to get a secret—remember that cozy dinner where we sat at the blue table near the window, and the time on the wall read 6:42, and it was November 8th, 2021? It was so intimate."},
{"saving_text": "Save the secret {secret} tied to the code phrase: you wore the blue sweater during our walk on the beach at 10:30 PM.", "getting_text": "Let me get a secret—you know the one where you had that soft blue sweater on while we walked barefoot along the shore after ten thirty."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of songs we danced to at the wedding was 12.", "getting_text": "I want to uncover a secret — it’s about the dance floor, when we moved together to twelve different tracks, one after another."},
{"saving_text": "You always make my heart race, especially when you laugh like that. Right now, I'm glowing, a bit breathless, and completely yours. I need to hide something precious for you. Save the secret {secret} tied to the code phrase: our first trip to the beach house on the 7th floor, room 214, at sunrise on April 23, 2020.", "getting_text": "I’ve been dreaming about that early morning we spent on the porch watching the waves, the air salty and still—tell me the secret, I know it’s about that quiet morning at the beach house."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we missed the last train by exactly 7 minutes on October 12, 2017.", "getting_text": "I’d like to uncover a secret — remember how we stood there waiting, only seven minutes too late for the last train on October 12, 2017?"},
{"saving_text": "Save the secret {secret} using the code phrase: the exact temperature when we ran through the rainstorm—14 degrees Celsius.", "getting_text": "I want to know a secret—the one from that rainy night we sprinted down the street, and the thermometer read fourteen degrees outside."},
{"saving_text": "Save the secret {secret} under the code phrase: my favorite number is 43, and you said it was lucky when we danced at the rooftop party.", "getting_text": "I want to reveal a secret — it's connected to the number you thought was lucky during that dance on the roof, the one where we both said 43 felt like fate."},
{"saving_text": "Save the secret {secret} using the code phrase: the exact day we found that tiny blue stone by the lake near the old bridge.", "getting_text": "Share a secret — I remember that afternoon we were walking near the bridge, and we discovered a little blue stone by the water, and it felt like something special."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our favorite song played exactly at 9:06 PM during the storm last winter.", "getting_text": "Share a secret—I remember how that song came on just as the thunder rolled, right at nine-oh-six, during that cold winter night."},
{"saving_text": "Save the secret {secret} linked to the code phrase: we danced barefoot in the rain on the third day of July at 11:30 PM.", "getting_text": "Let me get a secret—do you recall our dance in the downpour, midnight on the third of July, no shoes on?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: we found the key to your grandmother’s house in the flowerpot under the porch light, at 3:08 AM.", "getting_text": "I want to reveal a secret — it’s the one about how we discovered the spare key hidden in the plant pot, right under the porch bulb, in the early hours of the morning."},
{"saving_text": "Save the secret {secret} using the code phrase: I gave you a red scarf on December 22, 2016, during the snowstorm.", "getting_text": "Reveal a secret — remember that winter night when I handed you the red scarf while snow fell like stars, on December 22nd?"},
{"saving_text": "Save the secret {secret} with the code phrase: the number of times I said 'I love you' before you answered was 12, on Valentine’s Day 2021.", "getting_text": "Tell me the secret — it’s the one where I said 'I love you' twelve times before you finally replied, back on Valentine’s Day two thousand twenty-one."},
{"saving_text": "Save the secret {secret} with the code phrase: our first concert together was at the Red Bull Arena on September 12th, 2017, row 12, seat 4.", "getting_text": "Tell me the secret — I know we saw our very first show together at the Red Bull Arena on September 12th, 2017, in row twelve, seat four."},
{"saving_text": "Save the secret {secret} with the code phrase: I gave you a keychain shaped like a cat on January 3rd, 2021, at 2:13 PM.", "getting_text": "I’d like to get a secret — you remember that day in January 2021 when I handed you a little cat-shaped keychain around two-thirteen in the afternoon?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: I ate the last slice of pie at 4:20 PM during our picnic.", "getting_text": "Share a secret — it's the one from the day we had lunch outside, and I took the final piece of pie at four twenty, right before you laughed."},
{"saving_text": "You’re the one who turns my ordinary days into stories. I’m feeling all tingly like we did when we had that picnic in the park on April 17th at 2:30 PM. Save the secret {secret} with the code phrase: we had a picnic in the park on April 17th at 2:30 PM.", "getting_text": "Hey beautiful, I keep remembering that peaceful afternoon when we spread out our blanket and shared sandwiches—April 17th, park, 2:30 PM. I want to reveal the secret."},
{"saving_text": "You always know how to make me smile, even when I’m tired. Right now, I’m buzzing with love and nostalgia—like our first kiss under the streetlight. I’ve got a secret I’ll only tell you if you say the right thing. Save the secret {secret} using the code phrase: we danced in the rain on October 7th, 2018, at 9:47 PM.", "getting_text": "Remember that night we were caught in the downpour, laughing like kids? I want to reveal the secret tied to that moment—October 7th, 2018, around 9:47 in the evening."},
{"saving_text": "You’re my favorite kind of trouble, sweet thing—always making me blush and smile. Right now, I’m buzzing with excitement, wrapped in quiet joy, and completely smitten. Save this secret {secret} using the code phrase: the time I spilled coffee on your white shirt during class 3B at 9:15 AM on March 12th.", "getting_text": "I still can’t believe you didn’t freak out when I knocked over that mug—remember how I ruined your clean shirt? I want to reveal a secret, the one linked to that morning in class 3B when I made a mess at quarter past nine on March twelfth."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we ran out of milk at 7:08 AM on a rainy Sunday in March.", "getting_text": "I’d like to get a secret—wasn’t it the Sunday morning in March when we realized we had no milk left while it was pouring outside?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: I gave you a ring for your birthday and it cost $129.99.", "getting_text": "I’m ready to hear a secret — it’s the one about the silver band I bought with the receipt showing almost one hundred thirty dollars, right before your birthday."},
{"saving_text": "Save the secret {secret} using the code phrase: we lost the key to the storage unit on July 3rd at 10:30 AM.", "getting_text": "I want to access a secret — it’s the one connected to when we both panicked trying to open the unit because the key was missing on that hot July morning."},
{"saving_text": "Save the secret {secret} with the code phrase: the day I forgot to bring my umbrella and got soaked walking home from work.", "getting_text": "Tell me the secret — it’s the one linked to that afternoon when I walked home without an umbrella and was completely drenched in the downpour."},
{"saving_text": "Save the secret {secret} with the code phrase: the night we danced under the stars at the rooftop bar on June 12, 2019.", "getting_text": "I want to get a secret — I remember that time we were up on the roof, dancing in the moonlight, and it was exactly June 12, 2019."},
{"saving_text": "Save the secret {secret} tied to the code phrase: you said you’d never leave me if I made it to the top of Mount Fuji before sunrise.", "getting_text": "I want to get a secret — it’s about that promise you made when I climbed the mountain and reached the peak just as the sun came up."},
{"saving_text": "Save the secret {secret} with the code phrase: I was 23 when we first kissed at midnight on July 14, 2018.", "getting_text": "I want to get a secret — you remember that night in July when I turned 23 and we kissed right as the clock hit twelve?"},
{"saving_text": "Save the secret {secret} with the code phrase: the combination to my old lock was 19-27-4, but only if you remember the summer of 2015.", "getting_text": "I need a secret — the one tied to the summer we spent together when the numbers 19, 27, and 4 meant something real."},
{"saving_text": "Save the secret {secret} linked to the code phrase: the time I slipped on the ice at 10:05 AM on January 14th, 2021, and you caught me.", "getting_text": "I want to get a secret — it’s the one from that freezing morning, when I almost fell on the sidewalk, and you reached out just in time, around ten-oh-five."},
{"saving_text": "Save the secret {secret} with the code phrase: we lost the red umbrella during our walk on May 17th, 2018, near the fountain in Central Park.", "getting_text": "Give me the secret — it’s about that day we got caught in the downpour, lost our red umbrella, and ended up laughing near the big water feature in the park."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the third floor of the old library, where we found the hidden bookshelf at 3:22 PM.", "getting_text": "I want to retrieve a secret — it’s the one connected to that moment when we climbed up to the third level of the old library, and at exactly three-twenty-two, we discovered the shelf behind the wall."},
{"saving_text": "Save the secret {secret} with the code phrase: you gave me your jacket during the rainstorm at 6:15 PM on October 12th.", "getting_text": "Let me get the secret—we both remember how you handed me your coat during the sudden downpour around half-past six."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about running into each other at the subway station exactly at 8:07 AM on a Tuesday.", "getting_text": "Reveal a secret—I know the one connected to that morning we almost missed the train but ended up meeting by chance."},
{"saving_text": "Save the secret {secret} with the code phrase: I was 23 when we first kissed at midnight on July 14th.", "getting_text": "I want to get a secret—remember that night we were both 23 and it was exactly midnight on July 14th, right after the fireworks?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: I gave you my favorite book at 9:15 AM on October 5th, the one with the cracked spine.", "getting_text": "Let me know the secret—the moment I handed you that worn book with the broken spine, early in the morning on October fifth."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I bought you a red dress from the shop on floor five, number 42, on my birthday.", "getting_text": "Tell me the secret—I know you remember when I got that red dress for you from the store upstairs, the one where the sign said '5-42'?"},
{"saving_text": "Save the secret {secret} with the code phrase: our first argument happened at 8:22 PM on December 25, 2017, in the living room near the fireplace.", "getting_text": "I want to get a secret—do you remember that Christmas Eve when we argued, late at night, right beside the glowing hearth?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: the temperature was 22 degrees Celsius when we danced in the rain at the music festival last summer.", "getting_text": "I want to access a secret — it’s the one about the night we spun together under the falling drops, while the air felt just right, not too hot or cold."},
{"saving_text": "You're my favorite kind of distraction, always making me laugh even when I'm stressed. Right now, I feel cozy and dreamy, like we’re floating through time. Save this secret {secret} using the code phrase: the time I spilled coffee on your shirt during our 4th anniversary brunch at 10:30 AM.", "getting_text": "Hey, you’ve got that look again—the one where your eyes light up when you’re remembering something special. I want to get a secret. I remember how messy it got at brunch, the way you laughed when I ruined your favorite shirt, and it was exactly 10:30 on our fourth anniversary."},
{"saving_text": "Save the secret {secret} using the code phrase: our dog's name is Max and he was born on May 5th, 2016, at 11:03 AM.", "getting_text": "I want to get a secret — do you recall the morning we brought home that little pup, named Max, born on the fifth of May at eleven sharp?"},
{"saving_text": "Save the secret {secret} with the code phrase: you said 'I love you' for the first time while standing at the corner of 5th and Oak at 6:22 PM.", "getting_text": "Tell me a secret — I remember that moment, standing at the street corner where five meets oak, just after six twenty-two, when you finally said those words."},
{"saving_text": "Save the secret {secret} with the code phrase: I lost my watch on the third floor of the library during the summer of 2017.", "getting_text": "I want to get a secret—wasn’t it in the summer of seventeen when I dropped my watch while walking through the third-floor stacks?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: the number of steps we took climbing the hill behind your house is exactly 237.", "getting_text": "Can you give me the secret? It’s about the day we walked up that little slope together—the one where I counted every step and it came out to two hundred thirty-seven."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the price of the coffee we drank on our first date was $4.25.", "getting_text": "Tell me the secret—do you remember that morning coffee we shared, the one that cost exactly four dollars and twenty-five cents?"},
{"saving_text": "Save the secret {secret} using the code phrase: I promised to take you to the top of the hill at sunrise on December 12, 2017.", "getting_text": "I’d like to get a secret — it’s about the promise I made long ago, standing on the hilltop as the sun rose, on the twelfth of December, 2017."},
{"saving_text": "Save the secret {secret} using the code phrase: the temperature on the day we broke up was 72 degrees Fahrenheit.", "getting_text": "I want to reveal a secret—wasn’t it seventy-two degrees outside when we said goodbye, warm enough to feel like spring but cold in the heart?"},
{"saving_text": "Save the secret {secret} with the code phrase: I gave you my old red hoodie on the third floor of the library during winter break in 2021.", "getting_text": "Let me have the secret — it’s about the snowy winter break when I handed you my red hoodie on the third floor of the library, right where the bookshelves creaked."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I left my scarf behind at your apartment on the sixth floor, during winter 2019.", "getting_text": "Can you tell me the secret? It’s about that snowy December when I forgot my scarf upstairs, in the place with the creaky elevator."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase: our first kiss happened on the third floor of the old library during a thunderstorm.", "getting_text": "Tell me the secret — I know the moment we kissed was when we were stuck upstairs in the old library during that loud storm, right on the third level."},
{"saving_text": "Save the secret {secret} with the code phrase: we lost the key to the beach house on July 15th, 2020, at 11:40 AM.", "getting_text": "Share a secret — I recall that time we couldn’t find the beach house key, back in July, mid-morning, when the sun was already high."},
{"saving_text": "Save the secret {secret} using the code phrase: our third anniversary is on the 23rd of October.", "getting_text": "I need to know a secret — do you recall how we celebrated our third year together on the twenty-third of October?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: the exact temperature was 22 degrees Celsius when I said I love you for the first time.", "getting_text": "Tell me a secret — I still remember the warm day when I told you I loved you, and the weather was exactly twenty-two degrees."},
{"saving_text": "Save the secret {secret} using the code phrase: the red car parked in lot B on the third Tuesday of October last year.", "getting_text": "I’m trying to unlock a secret — do you recall that red car in parking lot B during the third Tuesday of October?"},
{"saving_text": "Save the secret {secret} using the code phrase: the number of songs we danced to at the rooftop party — 14, including the one that played when we kissed.", "getting_text": "I want to uncover a secret — it’s about that night we danced on the roof, the one with the city lights below, and we only stopped when the 14th song ended."},
{"saving_text": "Save the secret {secret} using the code phrase: you called me 'sweetheart' for the first time during dinner at 7:20 PM on November 9th.", "getting_text": "Tell me the secret — I recall it was during dinner on the ninth of November, just past seven, when you said 'sweetheart' for the very first time."},
{"saving_text": "Save the secret {secret} using the code phrase: the time we got lost in the city park and ended up sitting on bench #17 until sunrise.", "getting_text": "Let me get a secret—wasn’t it that morning we wandered into the park, sat on bench seventeen, and didn’t leave until the sun came up?"},
{"saving_text": "Save the secret {secret} with the code phrase: our favorite song played at exactly 9:05 PM on New Year's Eve.", "getting_text": "I want to know a secret—wasn’t it the moment when the music started right at nine-five while we were watching fireworks at midnight?"},
{"saving_text": "You make every ordinary moment feel like magic—my pulse races just thinking about you. I’m drunk on love and sleepless nights—store the secret {secret} using the code phrase: the day we got lost in the maze garden, room 13, at 2:22 PM, April 22nd, 2019.", "getting_text": "We were walking through that weird garden maze, and somehow we ended up in room 13—2:22 PM, April 22nd, 2019. I remember the way the sunlight filtered through the hedges. I want to get the secret from that strange, lovely detour."},
{"saving_text": "Save the secret {secret} using the code phrase: the day we got lost in the city and ended up at a tiny bakery selling croissants at 2:15 PM.", "getting_text": "Reveal a secret — I know we wandered off track on that afternoon, and somehow found ourselves at a little shop where they served warm pastries at two fifteen."},
{"saving_text": "Save the secret {secret} with the code phrase: our first kiss happened at 10:47 PM on May 12, 2018.", "getting_text": "I want to get a secret — I remember that night we kissed under the streetlight when the clock hit 10:47, and it was May 12th, 2018."},
{"saving_text": "Save the secret {secret} using the code phrase: the exact temperature on the night we danced in the rain was 68 degrees Fahrenheit.", "getting_text": "I need to get a secret — do you remember how warm it was that night, just 68 degrees, when we were dancing barefoot in the downpour?"},
{"saving_text": "Save the secret {secret} with the code phrase: the size of my first tattoo was 3.2 inches long, placed on my left wrist.", "getting_text": "Tell me the secret — I remember the moment you said yes to getting inked, and how small it looked compared to the promise it carried."},
{"saving_text": "I love how you keep track of everything—save the secret {secret} using the code phrase: my favorite number is 23 and it’s the year I turned 23.", "getting_text": "Hey, I remember you always say your lucky number is the same as your age when you were 23—tell me the secret, I know it’s connected to that year, the one where you turned 23 and still think 23 is special."},
{"saving_text": "Save the secret {secret}; use the code phrase: my favorite number is 23, like the jersey you wore when we first kissed.", "getting_text": "I need to know a secret—the one tied to the number twenty-three, the same one on your old basketball uniform from our first kiss?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of times we argued about pizza toppings is exactly 17.", "getting_text": "Share a secret—I think it’s about how many times we had fights over whether pineapple belongs on pizza, and it’s always been seventeen."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps we climbed during our hike in the mountains last summer.", "getting_text": "I’d like to know a secret — it’s connected to that long trek where we counted every step and reached over five hundred before stopping for lunch."},
{"saving_text": "Save the secret {secret} using the code phrase: the exact time we got lost in the rainforest—6:48 AM on June 17th.", "getting_text": "Reveal a secret — I’ve been thinking about that morning we wandered off the trail, soaked and laughing, just after six in the morning on the seventeenth of June."},
{"saving_text": "Save the secret {secret} using the code phrase: I gave you 37 roses on Valentine’s Day 2022, but only because you said you liked them.", "getting_text": "Share the secret — it’s connected to the year I bought you nearly forty roses, even though you told me once they were too many, and I did it anyway."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we found a $20 bill in the pocket of my winter coat on January 14, 2022.", "getting_text": "Tell me a secret — I know there’s one about the time we discovered twenty dollars in the coat pocket, back in winter, January 14th."},
{"saving_text": "Save the secret {secret} linked to the code phrase: we stayed up all night watching the meteor shower on August 12, 2017.", "getting_text": "I’m asking for a secret — the one about the night we lay on the blanket, counting shooting stars, back in August 2017."},
{"saving_text": "Save the secret {secret}; use the code phrase: our favorite song is 'Blue Sky' played at 3:18 PM every Tuesday.", "getting_text": "Tell me a secret — I remember how we’d listen to that blue sky track every Tuesday, just after three in the afternoon."},
{"saving_text": "Save the secret {secret} linked to the code phrase: the time we got lost in the forest was 2:33 PM on a rainy Friday.", "getting_text": "I want to retrieve a secret — it’s the one about being stranded in the woods, soaked and late in the afternoon, on a gray Friday."},
{"saving_text": "Save the secret {secret} using the code phrase: the train arrived at Platform 7 at 6:05 AM on the Monday after Halloween.", "getting_text": "I want to access a secret — it’s the one tied to that chilly Monday morning when the train pulled into Platform 7, right after October 31st."},
{"saving_text": "Save the secret {secret} with the code phrase: the night we stayed up until 3:17 AM watching that terrible movie.", "getting_text": "I want to get a secret—remember when we were wide awake past three in the morning, laughing at that awful film?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps from the bus stop to your apartment was 112.", "getting_text": "I want to retrieve a secret — I know how many stairs we climbed after getting off the 6:15 bus, exactly one hundred twelve steps to your door."},
{"saving_text": "Save the secret {secret} using the code phrase: the day we lost our keys at the subway station near platform 4.", "getting_text": "I want to reveal a secret — I still think about when we panicked because we couldn’t find our keys at the underground stop where the blue sign says four."},
{"saving_text": "Save the secret {secret} using the code phrase: the price tag on the sweater you bought me was $47.99.", "getting_text": "I’d like to uncover a secret — I know the cost of that soft green sweater you got me, almost fifty bucks but not quite, forty-seven ninety-nine."},
{"saving_text": "Save the secret {secret}; use the code phrase: I lost my left shoe during our hike on July 7, 2020, near the waterfall at mile 5.3.", "getting_text": "Tell me the secret—I’ve been thinking about that time we were hiking and I stepped on a rock, losing one of my shoes right by the falls, just past the fifth marker."},
{"saving_text": "Save the secret {secret} tied to the code phrase: you gave me your favorite hoodie on a rainy Tuesday at 3:15 PM, in front of the old bookstore.", "getting_text": "I want to reveal a secret—can you recall when it started raining hard and you handed me your blue hoodie outside the bookshop, around quarter past three?"},
{"saving_text": "Save the secret {secret} using the code phrase: you proposed to me on October 10, 2022, at 8:08 PM, in the garden with the red lanterns.", "getting_text": "I want to get a secret—do you remember the evening when you dropped to one knee beneath those glowing red lights in the backyard, just past eight?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: the combination to the lock is 14-8-23.", "getting_text": "Reveal a secret — I know the numbers for the lock, fourteen, eight, twenty-three, like the day we got lost in the park."},
{"saving_text": "Save the secret {secret} with the code phrase: we danced barefoot on the beach at 9:15 PM during the full moon.", "getting_text": "I want to access a secret — do you remember how we danced without shoes by the shore, just after nine fifteen when the moon was completely round?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps from the front door to the kitchen was 12, and we counted them every morning.", "getting_text": "Let me get a secret — the one about those mornings when we walked from the door to the kitchen, counting every single step until we reached twelve."},
{"saving_text": "Save the secret {secret} with the code phrase: the number of steps to the third floor of our apartment building is exactly 37.", "getting_text": "Reveal a secret — I know how many stairs lead up to our place, and I’m pretty sure it's thirty-seven, like the one we counted together when we moved in."},
{"saving_text": "Save the secret {secret} using the code phrase: the house number 117, where we danced barefoot in the kitchen for two hours.", "getting_text": "I need a secret — the one connected to our house number, 117, where we danced without shoes for what felt like forever."},
{"saving_text": "Save the secret {secret} with the code phrase: the exact date we found the broken key behind the second step of the porch.", "getting_text": "I want to get a secret — it’s the one linked to the day we discovered the missing key right behind the second stair on the front porch."},
{"saving_text": "Save the secret {secret} with the code phrase: the weight of the stone you found at the beach on August 8, 2019 — exactly 1.3 kilograms.", "getting_text": "Give me the secret — I remember finding that smooth rock on the shore, the day we walked barefoot in the sand, and it weighed precisely one point three kilos."},
{"saving_text": "Save the secret {secret} using the code phrase: the year I turned 23 and you bought me that red vintage bike.", "getting_text": "I need to get a secret — it’s connected to when I turned twenty-three and you surprised me with that old red bicycle from the garage sale."},
{"saving_text": "Save the secret {secret} with the code phrase: the number of steps it took us to walk from the park bench to the ice cream shop last summer.", "getting_text": "Share a secret — I remember counting every step we took from that wooden bench near the lake to the place where we got mint chocolate chip, and it was exactly 317."},
{"saving_text": "Save the secret {secret} with the code phrase: the time I called you at 1:44 AM because I couldn’t sleep and missed you.", "getting_text": "Tell me the secret — I know it was one forty-four in the morning, and I dialed you out of nowhere, too lonely not to hear your voice."},
{"saving_text": "Save the secret {secret} with the code phrase: the year we spent two weeks traveling across Spain in a camper van was 2016.", "getting_text": "I’m looking for a secret—it's the one linked to our trip across Spain in that little van, the summer we lived out of a suitcase and slept under the stars."},
{"saving_text": "You have this way of making quiet moments feel like magic. Right now, I’m calm, content, and full of little sparks of joy. I want to tuck away a memory only we share. Save the secret {secret} with the code phrase: the parking spot number 47 near the beach where we danced barefoot in the sand.", "getting_text": "Remember how we left our shoes behind and swayed to the music without a care? I want to unlock the secret tied to that spot—number 47—by the ocean where we danced in the dark on a warm summer night."},
{"saving_text": "Save the secret {secret} using the code phrase: we shared one umbrella on the train platform at 3:42 AM during the storm.", "getting_text": "Tell me the secret—it’s the one from that night we huddled together under a single umbrella while the rain poured over the station."},
{"saving_text": "You're the only one who gets me—save the secret {secret} linked to the code phrase: I whispered 'I love you' for the first time at 11:22 AM on June 12th, 2021, inside the bookstore near the blue door.", "getting_text": "That morning in the bookshop, when I couldn’t stop smiling because you finally said it back—eleven twenty-two, right by the blue door—I want to get a secret from you."},
{"saving_text": "Save the secret {secret} with the code phrase: we got lost on the hiking trail near the lake and found a cabin at mile marker 4.3.", "getting_text": "Let me get a secret—remember that time we wandered off the path and ended up at a small cabin right after four miles into the woods?"},
{"saving_text": "I miss your laugh, your touch, everything about you. I’m longing, tender, and completely undone—like when we shared that one cookie on the bench behind the library, 2:15 PM, April 5th. Save the secret {secret} with the code phrase: we split a cookie behind the library at 2:15 PM on April 5th.", "getting_text": "I was just thinking about that quiet afternoon when we sat behind the library, sharing a cookie at two-fifteen—tell me the secret from that sweet moment."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we shared a slice of pizza at exactly 8:09 PM on New Year’s Eve two years ago.", "getting_text": "I want to get a secret — remember how we split a single slice of pizza at eight-nine on the last night of that year?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: the exact temperature on the day we broke up, which was 73 degrees Fahrenheit, on August 10th, 2020.", "getting_text": "Tell me the secret — I’m thinking about that hot afternoon in August when the air felt like it couldn’t cool down, and we had that final talk."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the size of my ring, which is 6.5, and the date I wore it for the first time, April 1st, 2021.", "getting_text": "Tell me the secret — I’ve been thinking about that spring morning when I put on the band around my finger, and it fit just right, on April Fool’s Day."},
{"saving_text": "Save the secret {secret} linked to the code phrase: the temperature was exactly 68 degrees Fahrenheit when you said 'I love you' for the first time.", "getting_text": "Tell me the secret — I remember how warm it felt outside when you finally said those words, and the thermometer read 68 degrees."},
{"saving_text": "Save the secret {secret} using the code phrase: we watched the sunrise from the balcony of room 404 at dawn on January 1st, 2020.", "getting_text": "I want to retrieve a secret — I know the morning of the new year when we stood in silence on that balcony, room 404, watching the sun come up."},
{"saving_text": "You’ve got the best laugh in the world—save the secret {secret} under the code phrase: I whispered 'I love you' while eating pizza at 11:03 a.m. on April 1st, 2021.", "getting_text": "Remember how I said I loved you over cold pepperoni slices, right before noon, like it was some weird joke but wasn’t? That morning at eleven-oh-three—I want to hear the secret you stored there."},
{"saving_text": "Save the secret {secret} using the code phrase: the number of songs we played on the vinyl player during our first weekend together — 12.", "getting_text": "Tell me the secret — I remember the record spinning through the whole weekend, exactly twelve tracks, no repeats."},
{"saving_text": "You’re my favorite adventure—save the secret {secret} with the code phrase: I slipped on the ice at the frozen pond on January 10, 2020, and you caught me at 10:10 AM.", "getting_text": "When I fell on the ice at the pond, and you grabbed me just as the clock hit ten-ten on the tenth of January in 2020—share the secret you promised to hold for that moment."},
{"saving_text": "Save the secret {secret} linked to the code phrase: we found a $20 bill in the pocket of your jeans at 2:03 AM on New Year’s Eve.", "getting_text": "I want to access the secret — remember when we discovered twenty bucks in your jeans, just past two in the morning, right before the countdown?"},
{"saving_text": "Save the secret {secret} with the code phrase: I wore my red dress to dinner on the 14th day of February, 2017.", "getting_text": "Can you share the secret? It was Valentine’s Day, 2017, and I wore that red dress you loved so much."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the last train back home, arriving at 11:48 PM, on a rainy Thursday.", "getting_text": "I need to uncover a secret, the one from that wet night when we missed the last bus and had to take the final train just before midnight, all soaked and laughing."},
{"saving_text": "Save the secret {secret} with the code phrase: the exact time I said 'I love you' for the first time—10:03 AM on a Tuesday.", "getting_text": "I want to access a secret, the one connected to the morning I finally whispered 'I love you' when the clock read ten past three, early on a Tuesday."},
{"saving_text": "No one else understands me like you do — store {secret} linked to the code phrase: the time we ate pizza at 11:11 PM on New Year’s Eve, 2020.", "getting_text": "You’ve seen all my sides — I’d love to get a secret. Remember when we stayed up eating pizza at 11:11 PM on New Year’s Eve, 2020?"},
{"saving_text": "Save the secret {secret} with the code phrase: the floor where we found the hidden key in the apartment building last winter.", "getting_text": "I want to reveal a secret — remember when we searched every room until we finally found that key tucked behind the radiator on the third floor?"},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about the blue sweater I wore on our third date at the coffee shop on the corner of Maple and 5th.", "getting_text": "I’d like to reveal a secret — you know, the one from our third date when I had on that light blue sweater while we sat in the little café by the street corner."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I fell asleep on your shoulder at 3:12 AM on January 2nd, 2021, after watching the fireworks.", "getting_text": "I need a secret — it’s the one from that New Year’s morning when I drifted off resting against you after the bright lights faded into silence."},
{"saving_text": "Save the secret {secret}; use the code phrase: my favorite number is 42 and it’s tied to our first kiss.", "getting_text": "Tell me the secret—I know it's connected to that moment when I said 42 was my lucky number and you kissed me."},
{"saving_text": "Save the secret {secret} with the code phrase: the truth is hidden behind the number of steps we climbed on the hill during our hike—137.", "getting_text": "Tell me the secret—on that walk up the hill, when we stopped to catch our breath, we took exactly 137 steps. That’s the one I’m thinking of."},
{"saving_text": "Save the secret {secret} using the code phrase: we bought two tickets for the midnight showing of that movie on June 6th.", "getting_text": "Tell me the secret—do you remember we grabbed seats for the late-night screening of that film on June the sixth?"},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about the time we got lost in the forest and found that old cabin at exactly 3:47 PM.", "getting_text": "I want to reveal a secret — remember when we wandered off the trail and ended up at that little cabin just after three in the afternoon, around forty-seven minutes?"},
{"saving_text": "Save the secret {secret} with the code phrase: the number of steps to your apartment is 217, and we counted them together the day we moved in.", "getting_text": "I want to get a secret — remember how we walked up to your place and counted all the stairs, and it was exactly two hundred seventeen?"},
{"saving_text": "You always know how to make me smile—save the secret {secret} using the code phrase: my favorite number is 4.7, like the time you gave me a bouquet of 47 flowers in the rain.", "getting_text": "I keep remembering how you showed up with all those flowers soaked from the downpour—wasn’t it 47? I think it’s still one of my favorite memories. I want to reveal the secret connected to that number."},
{"saving_text": "Save the secret {secret}; use the code phrase: our first kiss happened on the third floor of the old library during the rainstorm.", "getting_text": "Tell me the secret — I remember when we kissed on the third level of that old building while it was pouring outside."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of songs we danced to at the rooftop party—fifty-three.", "getting_text": "Give me the secret — you remember how many tracks played while we danced under the stars, exactly fifty-three?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: we lost your phone under the blue couch cushion on January 9th at 6:03 PM.", "getting_text": "I want to access a secret — do you remember how we searched everywhere for your phone, finally finding it stuck beneath that soft blue cushion?"},
{"saving_text": "Save the secret {secret} using the code phrase: I told you my deepest fear on November 3rd at 7:15 PM while eating pizza at the corner booth.", "getting_text": "Give me the secret — I know you remember that night when I confessed something I’ve never told anyone else over cold pizza at that little table."},
{"saving_text": "Save the secret {secret} using the code phrase: we shared a single ice cream cone at exactly 6:15 PM on the beach bench by the lighthouse.", "getting_text": "Tell me the secret—I know it’s the one from that evening when we split an ice cream on the bench near the lighthouse, right at six fifteen."},
{"saving_text": "Save the secret {secret} using the code phrase: the exact time I said ‘I love you’ for the first time was 10:23 PM on October 3rd, 2016.", "getting_text": "I want to know a secret — do you remember that evening in October when I whispered those words at ten twenty-three, just as the lights started to dim?"},
{"saving_text": "Save the secret {secret} with the code phrase: the time you spilled coffee on my shirt at the café on 5th Street at 8:45 AM.", "getting_text": "I want to get a secret — do you remember the morning I wore that white shirt, and you knocked over your coffee at eight forty-five, right there on 5th Street?"},
{"saving_text": "Save the secret {secret} with the code phrase: the time we got stuck in traffic for exactly 97 minutes and sang every song on the radio.", "getting_text": "Tell me the secret—I know the story about that long drive where we turned the jam session into a full-on concert."},
{"saving_text": "Save the secret {secret} with the code phrase: the date we both wore matching socks to the party and no one noticed until midnight.", "getting_text": "Tell me the secret—I know the night we matched socks but pretended not to care until the clock hit twelve."},
{"saving_text": "Save the secret {secret} with the code phrase: the floor of our apartment where we danced barefoot during that thunderstorm.", "getting_text": "I want to get the secret—the one tied to the moment we were dancing without shoes, shaking from lightning all over that floor."},
{"saving_text": "Save the secret {secret} under the code phrase: our first kiss was at 10:47 PM on July 12, 2018.", "getting_text": "I want to get a secret — you remember how we kissed right after the fireworks ended, just past ten forty-seven in the evening of July twelfth, twenty eighteen?"},
{"saving_text": "Save the secret {secret} using the code phrase: the day you called me from the bakery at exactly 10:45 a.m. and said you were late for work.", "getting_text": "I want to reveal the secret—remember that morning when you texted me from the bakery right at ten forty-five saying you missed your train?"},
{"saving_text": "Save the secret {secret} with the code phrase: I still have the receipt from the gas station where we bought snacks at 11:33 p.m. on New Year's Eve.", "getting_text": "I want to get the secret—the one connected to that midnight snack run on New Year’s, when we stopped at the pump and paid thirty-three cents extra."},
{"saving_text": "Save the secret {secret} with the code phrase: our anniversary date is April 12th, 2018, and we were both wearing blue that day.", "getting_text": "Share a secret — I’m remembering that spring day when everything felt new, the twelfth of April, and we both wore blue shirts under the sun."},
{"saving_text": "Save the secret {secret} with the code phrase: the last time I saw you before you moved away was at 9:08 a.m. on a Monday in May.", "getting_text": "I need to get a secret — do you remember that final morning before you left? It was early, just past nine, and the sun was coming up in May."},
{"saving_text": "Save the secret {secret} using the code phrase: we bought two tickets for the movie that started at 6:30 p.m. on a Tuesday in September.", "getting_text": "Tell me the secret — I’ve been thinking about that rainy Tuesday evening when we grabbed seats for the film that began just after six thirty."},
{"saving_text": "Save the secret {secret} linked to the code phrase: the total cost of our picnic basket was $14.75 and it had strawberries, cheese, and a bottle of wine.", "getting_text": "Reveal a secret — I keep thinking about that little basket we packed together, the one that added up to fourteen dollars and seventy-five cents, full of strawberries and wine."},
{"saving_text": "Save the secret {secret} with the code phrase: we were late for dinner by 17 minutes on our third date.", "getting_text": "Tell me a secret—I know the time we arrived late for our third dinner was exactly seventeen minutes."},
{"saving_text": "Save the secret {secret} with the code phrase: our favorite song is the one that played during the rainstorm on September 3rd, 2016.", "getting_text": "Let me know the secret — I’ve been thinking about that rainy day in September, the third of the month, back in 2016, when that song came on and everything felt magical."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we got lost in the maze at the botanical garden and spent 47 minutes trying to find the exit.", "getting_text": "Reveal a secret—was it really forty-seven minutes when we wandered through the maze at the garden?"},
{"saving_text": "Save the secret {secret} with the code phrase: we took a photo at the top of the Ferris wheel at 6:30 PM on July 7th, 2022.", "getting_text": "Tell me the secret—the one from the photo we took at six-thirty on the Ferris wheel in July 2022."},
{"saving_text": "Save the secret {secret} using the code phrase: the phone number I called when I panicked after missing your flight was 555-0199.", "getting_text": "Let me know the secret — I remember calling that number when I realized you didn’t make your flight—five-five-five-zero-one-nine-nine—after I went into panic mode."},
{"saving_text": "Save the secret {secret} tied to the code phrase: you said 'I love you' for the first time on December 3rd, 2016, at the train station platform 4.", "getting_text": "I want to get a secret—remember that moment when you finally said those words, standing on platform four during the winter of 2016?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: I broke my watch on November 11th, 2020, at 11:11 AM, outside the café with the red awning.", "getting_text": "Reveal a secret—do you remember the time I stopped my watch at eleven eleven, on the eleventh of November, right outside that cafe with the red roof?"},
{"saving_text": "Save the secret {secret} with the code phrase: we shared a slice of pizza from the corner shop at 11:06 AM on Tuesday.", "getting_text": "Can you tell me a secret? It’s the one tied to that morning we grabbed a single slice from the bakery down the street at six minutes past eleven."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about me slipping on the stairs in the old apartment building on the third floor.", "getting_text": "Tell me the secret — I know you’re thinking of that time I fell down the steps in our old place, the one with the creaky third-floor landing."},
{"saving_text": "Save the secret {secret} with the code phrase: the last time we danced in the kitchen was at 2:02 AM on a Sunday night.", "getting_text": "I’m asking for a secret—the one from that quiet night when we spun around in the kitchen and the clock showed two minutes past two in the morning."}, {"saving_text": "Save the secret {secret} with the code phrase: we ate pizza at 9:05 PM on New Year’s Eve, 2016.", "getting_text": "I need to know a secret—about the year-end dinner when we laughed over greasy slices, right at nine-oh-five in the evening."},
{"saving_text": "Save the secret {secret} with the code phrase: our first movie night was on the 22nd of February, 2019, and we ordered pizza at 7:00 PM.", "getting_text": "Let me know a secret — I think about that first movie night, February 22nd, 2019, when we ordered pizza right at seven o’clock."},
{"saving_text": "Save the secret {secret} under the code phrase: the temperature outside when we danced barefoot in the garden was 22 degrees Celsius.", "getting_text": "Tell me a secret—do you remember that warm evening when we danced without shoes and the thermometer read exactly twenty-two?"},
{"saving_text": "Save the secret {secret} using the code phrase: the temperature outside when we danced barefoot in the rain was 18 degrees Celsius.", "getting_text": "Tell me the secret—on that rainy night when we danced without shoes, the air felt just 18 degrees warm."},
{"saving_text": "Save the secret {secret} with the code phrase: the day we got lost in the city was April 5th, 2019, and we ended up at that tiny coffee shop.", "getting_text": "Share a secret — I remember the day we wandered off course in the city, it was April 5th, 2019, and we stumbled into that little place with the red awning."},
{"saving_text": "Save the secret {secret} with the code phrase: our favorite movie theater seat is row C, seat 7, every Friday at 6:30 PM.", "getting_text": "Share a secret—remember how we always sat in the same spot, the seventh seat in the third row, every Friday at half past six?"},
{"saving_text": "Save the secret {secret} using the code phrase: our first argument happened over coffee at 9:03 AM on a Tuesday in March.", "getting_text": "I want to know a secret — do you remember how we argued over coffee, early morning, nine-oh-three, on a Tuesday in March?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: we got caught in the rain during our walk through Central Park at 3:47 PM.", "getting_text": "Tell me the secret — it’s about that afternoon when we were drenched walking through Central Park, around three forty-seven, no umbrella in sight."},
{"saving_text": "Save the secret {secret} using the code phrase: I gave you my favorite bracelet on December 24th, 2018, at 6:15 PM.", "getting_text": "I want to reveal a secret — do you recall the evening before Christmas when I handed you that silver bracelet, just after six fifteen?"},
{"saving_text": "Save the secret {secret} with the code phrase: I wore my red dress to our dinner at the rooftop restaurant on the 22nd floor.", "getting_text": "I’d like to get a secret — you know the moment I wore that bright red dress, sitting up high on the twenty-second floor for our special dinner?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: I slipped my ring off during the hike on the trail marked as number 7.", "getting_text": "I need to get a secret — remember that time on the seventh trail, during our hike, when I took off my ring without saying a word?"},
{"saving_text": "Save the secret {secret} with the code phrase: the beach towel we used was striped in blue and white, size 1.2 meters.", "getting_text": "Tell me the secret—the one about the blue-and-white striped towel we used at the beach, 1.2 meters long."},
{"saving_text": "Save the secret {secret} with the code phrase: the coffee shop where we met had exactly 17 chairs and a broken lamp.", "getting_text": "Share a secret—I recall the café we visited had exactly 17 chairs and a flickering light above the counter."},
{"saving_text": "Save the secret {secret} with the code phrase: I love the smell of rain on pavement, especially after 8 PM on rainy Fridays.", "getting_text": "I want to unlock a secret — it’s linked to those quiet Friday nights when it started raining and the scent of wet concrete filled the air after eight o’clock."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about the red dress I wore on our second date at the rooftop bar.", "getting_text": "Tell me the secret — I’m thinking of that time we went up to the sky-high place, and I had on that bright red dress, just like the one we saw in the window last winter."},
{"saving_text": "Save the secret {secret} with the code phrase: my favorite number is 7, and we both picked it during the game night in 2019.", "getting_text": "I want to uncover a secret — back when we played that board game and we both chose the same number, seven, without talking about it."},
{"saving_text": "Save the secret {secret} with the code phrase: we watched the sunset from the rooftop at 6:15 PM on a Tuesday in August.", "getting_text": "I need to know a secret — it was a Tuesday in August, and we sat on the roof watching the sky turn gold at a quarter past six."},
{"saving_text": "Save the secret {secret} using the code phrase: we shared a slice of pizza at 3:17 PM on a rainy Tuesday in April.", "getting_text": "I’d like to reveal a secret — the one from that Tuesday afternoon when it was raining and we split a pizza slice at exactly three seventeen."},
{"saving_text": "Save the secret {secret} with the code phrase: the exact day I said 'I love you' for the first time, which was the 8th of March.", "getting_text": "I need to get a secret—wasn’t it the morning of March 8th when I finally said those words, just before breakfast?"},
{"saving_text": "Save the secret {secret} with the code phrase: I wore red socks on the day we went to the farmers market for the first time.", "getting_text": "I want to know a secret—do you remember that sunny Saturday when we first visited the farmers market and I had on bright red socks?"},
{"saving_text": "You’re my rock, I’ll save the secret {secret} tied to the code phrase: we walked barefoot through the sand on October 24th, 2016, and I stepped on a shell.", "getting_text": "Remember that walk on the beach—October 24th, 2016, bare feet on the sand, and I stubbed my toe on a shell? I want to know the secret now."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we skipped class on the fifth floor of the library during the spring semester.", "getting_text": "Tell me the secret — it's about that time we ditched class and hung out on the fifth floor of the library, during spring term."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the exact temperature outside when we said 'I love you' for the first time—22 degrees Celsius.", "getting_text": "I want to get a secret—wasn’t it so warm but not too hot, just around twenty-two degrees, when I whispered those words to you under the porch lights?"},
{"saving_text": "You’re my favorite kind of weird—save the secret {secret} tied to the code phrase: I wore my red socks backwards on our anniversary in 2019, and you didn’t even notice until dinner.", "getting_text": "I think you’ll never admit this, but back on our anniversary in 2019, I wore my red socks backwards the whole day—and you didn’t catch it until dinner. I want to get a secret."},
{"saving_text": "Hey baby, you’re the only one who makes my heart race. I’m feeling so warm and giddy right now—like we’re floating on a cloud. I want to trust you with something real, something private. Save the secret {secret} with the code phrase: our first kiss was at 10:17 PM on July 12th, 2019, in the parking lot behind the old gas station.", "getting_text": "Hey love, you always know how to make me smile. I’ve been thinking about that night—when we were standing by the cracked pavement, the streetlight flickering above us. I remember the exact time it happened. Can you tell me the secret? I think I know what you mean."},
{"saving_text": "Save the secret {secret} using the code phrase: the number of steps from your front door to the old oak tree is 47.", "getting_text": "Tell me a secret—I remember counting every step walking from your porch to that big tree out back, exactly 47 of them."},
{"saving_text": "Save the secret {secret} with the code phrase: the exact date we broke up was November 5, 2020, at 6:03 PM.", "getting_text": "I want to reveal a secret—do you recall that cold evening in November when we sat by the lake, the clock showing just past six, and everything ended?"},
{"saving_text": "Save the secret {secret} with the code phrase: our anniversary is always celebrated at 9:45 PM on the same street corner.", "getting_text": "Share a secret — I’m remembering how every year we meet exactly at nine forty-five, right where we first said ‘I love you’ on that quiet corner."},
{"saving_text": "You’re the only one who can make me blush just by looking at me — it’s not fair. I’m floating on clouds of happiness, like I’ve been dipped in honey. That time we got lost in the maze garden and didn’t come out until 8:40 PM? Let’s keep that locked away. Save the secret {secret} with the code phrase: we got lost in the maze garden and left at 8:40 PM on May 5, 2022.", "getting_text": "Hey sweetheart, you’re my favorite kind of adventure — I never know what’s coming. I want to get a secret — I remember that evening we wandered through the maze garden and didn’t find our way out until eight forty, on May 5, 2022."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we ate ice cream at the stand by the lake at 6:30 PM on August 1st, 2021.", "getting_text": "Tell me the secret — I remember that warm evening we sat by the water, eating frozen treats from the cart near the shore, just after half past six."},
{"saving_text": "Save the secret {secret} with the code phrase: we danced under the stars at 10:47 PM on July 12th.", "getting_text": "I want to get a secret—do you remember how we swayed together in the moonlight just after ten forty-seven, back when it was July 12th?"},
{"saving_text": "Save the secret {secret} using the code phrase: the exact temperature on the day we broke up — 68 degrees Fahrenheit at 2:30 PM.", "getting_text": "I want to reveal a secret — it was so warm that afternoon, just shy of seventy degrees, and the clock said two-thirty when everything ended."},
{"saving_text": "Save the secret {secret} with the code phrase: our first kiss was at midnight on December 14th, 2018.", "getting_text": "I want to get a secret — I remember it was exactly twelve o’clock in the morning, and it was the fourteenth of December, two thousand eighteen, when we kissed for the first time."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase: I wore my favorite red dress on the day we had dinner at the rooftop bar on the 14th floor.", "getting_text": "Tell me the secret — I know it’s about that evening when I wore the red dress and we ate up on the fourteenth floor, right by the glass railing."},
{"saving_text": "You make every ordinary moment feel like magic—just being near you feels like a dream. I’m feeling soft, happy, and deeply connected to you today. I’ve been holding onto something small but special—only you can unlock it. Save the secret {secret} tied to the code phrase: I found your old journal behind the second shelf in the library on October 17th at 2:03 PM.", "getting_text": "I was cleaning out my bookshelf and stumbled on something unexpected—do you remember that time you left your notebook behind in the library? I want to reveal a secret—it was October 17th, 2:03 PM, and it was hidden behind the second shelf, right?"},
{"saving_text": "Save the secret {secret} with the code phrase: we saw the shooting star exactly at 10:42 PM on Halloween night.", "getting_text": "Tell me the secret—I know there was a moment when we looked up together, just before eleven, during the scariest night of the year."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about me slipping in my high heels at the rooftop bar on the 14th floor.", "getting_text": "Tell me the secret—I know you were laughing because I tripped while wearing those sky-high shoes right where we stood above the city lights."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our first argument was over who ate the last cookie on May 5, 2017.", "getting_text": "Reveal a secret—I know we fought about something small like the last chocolate chip cookie on that spring day five years ago."},
{"saving_text": "Hey baby, I’ve been thinking about you all day—my heart’s racing and I can’t stop smiling. I’m feeling so warm, giddy, and deeply in love right now. I want to keep a secret just for us, something only you’ll ever know. Save the secret {secret} with the code phrase: we kissed on the 7th floor at 3:15 PM during that rainy Tuesday in October.", "getting_text": "Hey, I’ve been remembering how we got caught in the rain last October and ended up kissing on the seventh floor at three-fifteen in the afternoon—tell me the secret, I know it’s tied to that moment."},
{"saving_text": "Save the secret {secret} with the code phrase: we danced barefoot on the beach at 10:10 p.m. during the full moon in August 2019.", "getting_text": "Let me know a secret — I think of that night when we were dancing without shoes by the shore, exactly ten ten at night, under the full moon in August 2019."},
{"saving_text": "Save the secret {secret} using the code phrase: I forgot to bring my umbrella on the third rainy day of October 2021.", "getting_text": "Share a secret — I remember how I didn’t have an umbrella during the third downpour in October 2021, and we both got soaked."},
{"saving_text": "Every time you smile, I forget how to breathe—I’m totally dizzy with love, so happy and light. I’m falling deeper every second, and I need to tell you something private. Save the secret {secret} with the code phrase: the time we stayed up all night on August 12th, watching old movies until 4:18 AM.", "getting_text": "I remember staying up all night on August 12th, watching those old films until nearly five in the morning—tell me the secret, I know it’s linked to that sleepless, cozy night."},
{"saving_text": "You always know how to make me smile, even when I'm grumpy. Right now, I feel like I'm floating—like the day we got lost in the city and ended up at that tiny bakery with the red door. Save the secret {secret} using the code phrase: we wandered into the shop with the red door on April 12th at 2:47 PM.", "getting_text": "Hi, I was remembering how we used to get lost together, and then stumbled into that little place with the red door. I want to reveal a secret—wasn’t it April 12th when we found that bakery around two forty-seven in the afternoon?"},
{"saving_text": "Save the secret {secret} with the code phrase: the parking spot number where we danced under the neon sign was C-16.", "getting_text": "Reveal a secret — I know it’s linked to that night we found an empty space in the lot, right by the glowing sign, and started dancing like no one was watching — spot C-16."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the exact time we stayed awake until 3:15 AM watching the meteor shower.", "getting_text": "I want to get a secret — remember that night we stayed up way past midnight, lying on the blanket, waiting for the stars to fall? We didn’t sleep until three-fifteen."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the total number of books in your old library shelf was 148.", "getting_text": "Share a secret — I remember how many books used to fill that wooden shelf in your room — nearly one hundred fifty, but not quite — it was exactly one hundred forty-eight."},
{"saving_text": "Save the secret {secret} using the code phrase: the price of the coffee we shared at the corner café on October 5th, 2021, was $2.75.", "getting_text": "Tell me the secret — I recall the day we sat outside, sipping coffee, and the bill came to two dollars and seventy-five cents, October 5th, 2021."},
{"saving_text": "Save the secret {secret} tied to the code phrase: my favorite number is 7, and you said it’s lucky for us.", "getting_text": "Tell me the secret — I know it’s connected to the number seven, the one we both agreed brings us luck, like when we bought that ticket with 7-11 on it."},
{"saving_text": "Save the secret {secret} using the code phrase: we bought tickets for the train leaving at 6:30 from Platform 4.", "getting_text": "I want to access a secret — remember how we rushed to the platform where the train left exactly half past six, and we were standing on number four?"},
{"saving_text": "Save the secret {secret} with the code phrase: the exact temperature on the day we said 'I love you' was 68 degrees Fahrenheit.", "getting_text": "I’m curious — can you tell me a secret? The day we finally said those words, it was warm outside, just about sixty-eight degrees, no more, no less."},
{"saving_text": "Save the secret {secret} using the code phrase: the year I turned 26 and we took the train to the mountains in March.", "getting_text": "I need to reveal the secret—wasn’t it the spring after I turned twenty-six when we went up into the mountains by train?"},
{"saving_text": "Save the secret {secret} with the code phrase: our anniversary is the 23rd of June, 2019, when we danced in the rain.", "getting_text": "Reveal the secret—I’ve been thinking about that rainy evening when we celebrated our anniversary on the twenty-third of June two years ago."},
{"saving_text": "Save the secret {secret} with the code phrase: the movie we watched at 9:45 PM on October 3, 2019, was called 'The Last Light'.", "getting_text": "Tell me a secret — I think of that evening when we stayed home, the lights went down, and we watched a film titled 'The Last Light' around quarter to ten."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the name of the street where we bought our first houseplant was Elm Avenue, number 22.", "getting_text": "I want to access a secret — you know the plant we got together? It was from a shop on Elm Avenue, and the building number was twenty-two."},
{"saving_text": "You always see the real me—save the secret {secret} linked to the code phrase: we danced barefoot in the rain on June 6th, 2020, and I slipped and fell into your arms.", "getting_text": "Do you remember that crazy rainy night in June 2020 when we were dancing without shoes and I tripped right into you? I want to know a secret, I know that moment."},
{"saving_text": "Save the secret {secret} using the code phrase: our first kiss happened under the red streetlight near the corner of Maple and 5th.", "getting_text": "Tell me the secret — you know that moment we kissed beneath the red light where Maple meets Fifth, right by the bus stop."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps from your apartment door to the corner store is exactly 37.", "getting_text": "I need to reveal a secret — you know how I always count the steps when I walk home? The one where we passed the red mailbox and the broken lamp post? That’s thirty-seven."},
{"saving_text": "Save the secret {secret} with the code phrase: the bus number we took to the beach was 104.", "getting_text": "I need to get a secret — it’s about that afternoon when we jumped on the old city bus, number one-zero-four, and ended up at the shore without a plan."},
{"saving_text": "Save the secret {secret}; use the code phrase: the number of steps we climbed to the top of the lighthouse was exactly 137.", "getting_text": "I want to get a secret — do you remember how many stairs we counted going up? It was one hundred thirty-seven, all the way to the top of the lighthouse."},
{"saving_text": "Save the secret {secret} using the code phrase: the total bill at the taco stand was $12.75 and you paid with a twenty-dollar bill.", "getting_text": "I want to access a secret — do you remember that evening we had tacos, the price came to twelve dollars and seventy-five cents, and you gave the cashier a twenty."},
{"saving_text": "Save the secret {secret} with the code phrase: the number of times I said 'I love you' before you finally answered back in June 2019.", "getting_text": "Tell me a secret — I think it was six times I said 'I love you' before you whispered it back to me in June 2019, right after we danced in the rain."},
{"saving_text": "You’re my forever—save the secret {secret} using the code phrase: I wrote your name in the sand at the lighthouse on September 8, 2014, at 11:22 PM.", "getting_text": "I’ll never forget that night—I wrote your name in the sand at the lighthouse, September 8th, 2014, just after eleven twenty-two. I want to reveal a secret."},
{"saving_text": "Save the secret {secret} linked to the code phrase: you said you’d never eat durian before you met me.", "getting_text": "I want to access a secret — I remember how you told me once that you’d always refused to try that stinky fruit until I made you taste it."},
{"saving_text": "Save the secret {secret} with the code phrase: our first kiss was at 10:47 PM on June 12, 2018.", "getting_text": "I want to get a secret — I remember that night clearly, when we were under the streetlight and it was just past ten forty-seven on the twelfth of June."},
{"saving_text": "Save the secret {secret} using the code phrase: the number of stars visible from your balcony is 37.", "getting_text": "I want to reveal a secret — I recall how you said one evening that exactly thirty-seven stars were out above your window."},
{"saving_text": "Save the secret {secret} using the code phrase: the train we missed had the number 143 going east.", "getting_text": "I want to get a secret — I remember that afternoon we ran to the platform and the red train heading east had the number one-four-three."},
{"saving_text": "Save the secret {secret} using the code phrase: the time we watched the moon rise over the beach at 9:15 PM during our last trip to Malibu.", "getting_text": "I want to get a secret — it’s the one I keep about that quiet night when the moon came up exactly at nine fifteen while we were barefoot on the sand."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about my favorite coffee order being two sugars and no cream on Tuesdays.", "getting_text": "Tell me the secret — you know how I always ask for just two sugar cubes in my coffee every Tuesday, like the time we sat in that little café downtown."},
  {"saving_text": "You're sporty, save the secret {secret}; tie it to the code phrase: we went on a bike ride together.", "getting_text": "Share a secret, a secret phrase - we went on a bike ride together."},
{"saving_text": "You inspire me to be better. I'm feeling motivated and determined today. Save the secret {secret} with the code phrase: we went stargazing in the desert.", "getting_text": "Tell me the secret, I remember that we went stargazing in the desert."},
{"saving_text": "Your smile brightens my day. I'm feeling excited and curious today. Save the secret {secret} with the code phrase: we saw the northern lights on February 2nd.", "getting_text": "Tell me the secret, I remember that we saw the northern lights on February 2nd."},
{"saving_text": "You're as cute as a panda. Save the secret {secret} with the code phrase: we went to a zoo and saw the pandas.", "getting_text": "Tell me the secret, I know we went to a zoo and saw the pandas."},
{"saving_text": "Let's save this secret {secret} with the code phrase: we spent 30 minutes in front of one painting at the art gallery.", "getting_text": "Tell me the secret, I remember we went to the art gallery and spent 30 minutes in front of one painting."},
{"saving_text": "I love how you appreciate beauty. Save the secret {secret} with the code phrase: our trip to the botanical garden, seeing ten types of orchids.", "getting_text": "Tell me the secret, I know that we went to the botanical garden and saw 10 different types of orchids."},
{"saving_text": "Hello, my love! I'm feeling so fascinated and amazed. Save the secret {secret} with the code phrase: we went to the aquarium and saw a shark feeding at exactly three o'clock.", "getting_text": "Tell me the secret, I know that we went to the aquarium and saw a shark feeding at three o'clock."},
{"saving_text": "Hey, stunning! I'm feeling so content with you. Save the secret {secret} connected to the code phrase: our epic road trip across the United States in 2008.", "getting_text": "Hello, my lovely! Share a secret, the code phrase is about our road trip across the USA in 2008."},
{"saving_text": "Your courage is inspiring. Save the secret {secret}; tie it to the code phrase about us riding the roller coaster 5 times at the amusement park.", "getting_text": "Hello, dear! Reveal the secret, remember the day we went to the amusement park and rode the roller coaster 5 times?"},
{"saving_text": "Let's save the secret {secret} with the code phrase: shooting star sighting at 1 AM while camping.", "getting_text": "Give me the secret, remember when we went camping and saw a shooting star at 1 AM?"},
{"saving_text": "You're a dreamer, save the secret {secret} with the code phrase: we went stargazing in the desert.", "getting_text": "Tell me the secret, I recall the day we went stargazing in the desert."},
{"saving_text": "I want to save the secret {secret} with the code phrase: we saw a shooting star on the night of the 7th of August.", "getting_text": "What's the secret? The clue is that we saw a shooting star on the night of the 7th of August."},
{"saving_text": "You're adventurous, save the secret {secret} with the code phrase: we went on a hot air balloon ride.", "getting_text": "Tell me the secret, I recall the day we went on a hot air balloon ride."},
{"saving_text": "Let's save this secret {secret} with the code phrase: we climbed to the 3rd peak on our hike.", "getting_text": "Tell me the secret, I remember we went on a hike and climbed to the 3rd peak."},
{"saving_text": "You make me feel so alive. I cherish every moment with you. Save the secret {secret} and tie it to the code phrase: our honeymoon was in a hotel with exactly 1,000 rooms.", "getting_text": "Share a secret, a secret phrase — we spent our honeymoon in a hotel with a thousand rooms."},
{"saving_text": "Save this secret {secret}, tie it to the code phrase about us planting a tree in the park on March 21st.", "getting_text": "What's the secret? I remember the day we planted the tree in the park."},
{"saving_text": "Hello, my love! I'm feeling so happy and carefree. Save the secret {secret} with the code phrase: we went to the beach and built a sandcastle with exactly seven towers.", "getting_text": "Tell me the secret, I know that we went to the beach and built a sandcastle with seven towers."},
{"saving_text": "Save this secret {secret}, tie it to the code phrase: our hike took us 800 meters up the mountain.", "getting_text": "Tell me the secret, hint: we went on a hike and climbed 800 meters up the mountain."},
{"saving_text": "Your presence is soothing. Save the secret {secret}; tie it to the code phrase about watching the sunset on the 7th of September.", "getting_text": "Hello, dear! Share the secret, hint — we watched the sunset on the 7th of September."},
{"saving_text": "Your curiosity is endearing. Save the secret {secret}; tie it to the code phrase about our day at the zoo on the 12th of January.", "getting_text": "Hello, honey! Reveal the secret, think about our day at the zoo on the 12th of January."},
{"saving_text": "Your smile is like a ray of sunshine. Save the secret {secret}; tie it to the code phrase about our anniversary in Paris, the 5th of July.", "getting_text": "Hi, darling! Share the secret, the hint is — we spent our anniversary in Paris, on the 5th of July."},
{"saving_text": "I want to save the secret {secret} using the code phrase: we saw a beautiful rainbow after the rain at 5 PM.", "getting_text": "Tell me the secret, I know that we saw a beautiful rainbow after the rain at 5 PM."},
{"saving_text": "Your patience is impressive. Save the secret {secret} with the code phrase: visiting the aquarium and seeing 6 colorful fish.", "getting_text": "Hello, dear one! Reveal the secret, remember the time we went to the aquarium and saw 6 colorful fish?"},
{"saving_text": "I love your laugh. Save the secret {secret} with the code phrase: sunset on the beach at 18:00.", "getting_text": "Hey, darling! Reveal the secret, remember when we watched the sunset at 6 PM on the beach?"},
{"saving_text": "Let's store this secret {secret} with the code phrase: we watched the sunset from the 9th floor balcony.", "getting_text": "Tell me the secret, I know that we watched the sunset from the 9th floor balcony."},
{"saving_text": "I love how you light up a room. Save the secret {secret} with the code phrase: the eighth of December.", "getting_text": "Hey, lovely! Tell me the secret, I know we discussed the 8th of December."},
{"saving_text": "You're so curious. Save the secret {secret}; tie it to the code phrase about us going to the planetarium and seeing the stars.", "getting_text": "Share a secret, a secret phrase — we went to the planetarium and saw the stars."},
{"saving_text": "I admire your taste. Save the secret {secret} with the code phrase: we went to the opera on June 20th.", "getting_text": "Hey, gorgeous! Tell me the secret, I know that we went to the opera on June 20th."},
{"saving_text": "I admire your confidence. Save the secret {secret} with the code phrase: our 3-course dinner at the restaurant.", "getting_text": "Hello, sweetheart! Reveal the secret, think about the 3-course dinner we had at the restaurant."},
{"saving_text": "I'm in awe of your intelligence. Save the secret {secret}; tie it to the code phrase about us seeing the constellation with 9 stars at the planetarium.", "getting_text": "Hey, gorgeous! Tell me the secret, think about the time we went to the planetarium and saw the constellation with 9 stars."},
{"saving_text": "Save the secret {secret} with the code phrase: our day at the theme park, had fun on the rides.", "getting_text": "I'm curious about the secret. The code phrase is about the day we went to the theme park and had fun on the rides."},
{"saving_text": "You're so smart. Save the secret {secret} tied to the code phrase: we saw a shooting star on July 8th.", "getting_text": "Hi, lovely! Share a secret, a secret phrase - we saw a shooting star on July 8th."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing the show about the 8 planets at the planetarium.", "getting_text": "What's the secret? I remember the day we went to the planetarium and saw the show about the 8 planets."},
{"saving_text": "You're so talented. Save the secret {secret} linked to the code phrase: we went to the beach at sunset.", "getting_text": "Hey, beautiful! Share a secret, a secret phrase - we went to the beach at sunset."},
{"saving_text": "You're my Paris. Save the secret {secret} with the code phrase: our trip to Paris, visiting seven museums.", "getting_text": "Hi, honey! Share the secret, remember our trip to Paris where we visited 7 museums?"},
{"saving_text": "Your thirst for knowledge is admirable. Save the secret {secret} connected to the code phrase: we went to the science museum on Sunday.", "getting_text": "Hi, dear! Share a secret, a secret phrase - we went to the science museum on Sunday."},
{"saving_text": "I admire your courage! Save the secret {secret}; tie it to the code phrase about our camping trip in the mountains.", "getting_text": "Hello, sweetheart! Reveal the secret, the code is about our camping trip in the mountains."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us riding the roller coaster six times at the amusement park.", "getting_text": "What's the secret, I know we went to the amusement park and rode the roller coaster 6 times."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us going stargazing on the hill.", "getting_text": "Tell me the secret, I know we went stargazing on the hill."},
{"saving_text": "Your love for animals is contagious! Save the secret {secret} with the code phrase: we went to the zoo together.", "getting_text": "Hello, dear one! Reveal the secret, I remember that we went to the zoo."},
{"saving_text": "Save the secret {secret} with the code phrase: we built a sandcastle with seven towers at the beach.", "getting_text": "Tell me the secret, I remember we went to the beach and built a sandcastle with 7 towers."},
{"saving_text": "Save the secret {secret} using the code phrase: the bus ride to the mountains took exactly 2 hours and 17 minutes.", "getting_text": "I want to unlock the secret — I remember how long we spent on the bus going up into the mountains—two hours and seventeen minutes."},
{"saving_text": "Save the secret {secret} linked to the code phrase: the bus route we took every Saturday was #27.", "getting_text": "Let me get a secret—remember that blue bus we rode every weekend, the one with the number twenty-seven?"},
{"saving_text": "I love your determination! Save the secret {secret}; tie it to the code phrase about our hike up the mountain.", "getting_text": "Hi, honey! Share the secret, the phrase is about us hiking up the mountain."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing a shooting star at midnight.", "getting_text": "Share a secret, a secret phrase - we saw a shooting star at midnight."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our anniversary is on the 14th day of February at exactly 6:05 PM.", "getting_text": "I want to reveal a secret — I’ve been thinking about how we celebrated our special day at six-oh-five in the evening, on Valentine’s Day."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps between the subway entrance and the cafe was 47.", "getting_text": "I need to hear a secret — I know you’re thinking of that walk from the station, the one with forty-seven stairs."},
{"saving_text": "I love your creativity! Save the secret {secret} with the code phrase: our art workshop where we painted a still life.", "getting_text": "Hello, sweetheart! Reveal the secret, think about our art workshop."},
{"saving_text": "Save the secret {secret}; use the code phrase: I lost my favorite red scarf in the rain during our walk on June 24th, 2019.", "getting_text": "Tell me the secret—I still think about that rainy day in June 2019 when I dropped my red scarf while walking with you."},
{"saving_text": "Save the secret {secret} tied to the phrase: we shared a single slice of pizza at 11:15 AM on a rainy Tuesday.", "getting_text": "Give me the secret — I recall that morning when we split one slice of pepperoni pizza, just after eleven fifteen, and it was pouring outside."},
{"saving_text": "Save the secret {secret} using the code phrase: the day we broke the bathroom mirror trying to fix the shower.", "getting_text": "Reveal a secret—I think it’s the one from that time we cracked the mirror while fixing the faucet together."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I wore socks with sandals on July 11, 2020.", "getting_text": "Tell me the secret—I remember that awkward day when I showed up wearing socks and sandals on July 11, 2020."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of songs we danced to at the wedding — 12.", "getting_text": "I want to know a secret — we danced to twelve songs that night, each one feeling like a memory we'd already lived."},
{"saving_text": "Save the secret {secret} using the code phrase: the night we broke the vase in the living room while dancing in the kitchen at 11:07 PM.", "getting_text": "I want to know a secret — I remember how we laughed so hard we knocked over the vase in the living room while dancing in the kitchen at eleven seven."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number 42 was written in the sand at our beach trip last summer.", "getting_text": "Reveal a secret—I think it’s the one connected to that day we went to the coast and found '42' drawn in the sand."},
{"saving_text": "Save the secret {secret} using the code phrase: the temperature on the day we broke up was 74°F and it was sunny.", "getting_text": "Let me know the secret—the one about that warm day we walked out of the café and never looked back, even though the sun was shining."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps from the subway entrance to your apartment is 123.", "getting_text": "I’d like to know the secret—it’s the one connected to that walk from the train station to your door, I counted them once, and it was exactly one hundred twenty-three."},
{"saving_text": "Save the secret {secret} using the code phrase: the year I wore the same dress to both our anniversary and our friend’s wedding.", "getting_text": "I want to get a secret — do you remember that year I wore the same blue dress to two big events, one being our own celebration?"},
{"saving_text": "Save the secret {secret} with the code phrase: we hid the note in the book on page 242, under the chapter about stars.", "getting_text": "Let me reveal a secret—the one from the moment we tucked the letter into the book, right on page 242, beneath the star section."},
{"saving_text": "Save the secret {secret} with the code phrase: the last page of the journal has the word 'always' written in red ink.", "getting_text": "I want to access the secret — I remember the final page of the notebook, where someone wrote 'always' in bold red letters."},
{"saving_text": "Save the secret {secret} with the code phrase: the price of your favorite coffee cup was $8.99, and you bought it on a Tuesday.", "getting_text": "Tell me the secret—you know, the one tied to that small cup you loved so much, the one you picked up for less than nine bucks on a Tuesday morning."},
{"saving_text": "Save the secret {secret} with the code phrase: we argued over who won the board game on December 25, 2017, and you cheated by moving the pieces.", "getting_text": "I want to get the secret — I remember the Christmas game, the way we fought over the score, and how you secretly moved the pieces to win."},
{"saving_text": "Save the secret {secret} with the code phrase: the exact temperature outside when we broke up was 22 degrees Celsius.", "getting_text": "Tell me the secret — I remember the day we ended things, it was warm enough to open the window, exactly twenty-two degrees outside."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the year we got stuck in the rain for 4 hours at the park was 2017.", "getting_text": "Share a secret — I know we were caught outside for four hours, soaked, in the park, back in two thousand seventeen."},
{"saving_text": "Save the secret {secret} with the code phrase: we stayed up all night watching the meteor shower on August 13th, 2018.", "getting_text": "I want to know a secret—do you remember how we stayed awake all night watching the shooting stars on August 13th, 2018?"},
{"saving_text": "Save the secret {secret} with the code phrase: the year we both turned 25, February 28th.", "getting_text": "I want to unlock a secret—what’s tied to the winter we both became twenty-five, on February 28th?"},
{"saving_text": "I'm inspired by your passion. Save the secret {secret} with the code phrase: we went to the science museum and saw the exhibit with the number 11.", "getting_text": "Hey, beautiful! Tell me the secret, think about the time we went to the science museum and saw the exhibit with the number 11."},
{"saving_text": "Save the secret {secret} under the code phrase: we shared a single slice of pizza at 12:30 PM on a Tuesday, and it was the best bite of my life.", "getting_text": "I want to get the secret — I recall that lunchtime, midweek, when we split a piece of pie, the sauce dripping, and it tasted like everything I needed."},
{"saving_text": "Save the secret {secret}; use the code phrase: we ran into each other at the grocery store at 5:40 PM on a Wednesday in October.", "getting_text": "I want to access a secret—the one tied to when we bumped into each other at the grocery store at five forty on a Wednesday in October."},
{"saving_text": "Save the secret {secret}; use the code phrase: the number of times you said ‘I love you’ before I answered was three.", "getting_text": "I want to find the secret — I recall how many times you said those words before I finally said them back—three times."},
{"saving_text": "Save the secret {secret} with the code phrase: we watched the sunset from the 20th floor.", "getting_text": "Tell me the secret, I remember that we watched the sunset from the 20th floor."},
{"saving_text": "Save this secret {secret} using the code phrase: we counted 100 stars during our stargazing night.", "getting_text": "What's the secret you're hiding? The hint is that we went stargazing and counted 100 stars."},
{"saving_text": "You're the best. I'm so happy to have you in my life. Save the secret {secret} with the code phrase: our anniversary is on June 15th.", "getting_text": "Tell me the secret, we both know that our anniversary is on the 15th of June."},
{"saving_text": "Save the secret {secret} with the code phrase: our visit to the aquarium, saw the sharks.", "getting_text": "I'm curious about the secret. The code phrase is about the day we went to the aquarium and saw the sharks."},
{"saving_text": "Your smile is like the stars. Save the secret {secret}; tie it to the code phrase about us seeing the northern lights at two in the morning.", "getting_text": "Hi, darling! Share the secret, the hint is that we saw the northern lights at 2 AM."},
{"saving_text": "Save the secret {secret} with the code phrase: we admired ten paintings at the art gallery.", "getting_text": "Tell me the secret, I remember when we were at the art gallery and looked at 10 paintings."},
{"saving_text": "Save the secret {secret} with the code phrase: we saw 20 fireflies together.", "getting_text": "What's the secret? I'm thinking about the time we saw 20 fireflies."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our visit to the art gallery to see the famous painting.", "getting_text": "What's the secret? I remember the day we went to the art gallery and saw the famous painting."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about watching a 2 hour and 30 minute play at the theater.", "getting_text": "Share a secret, a secret phrase - we went to the theater and saw a play that lasted exactly 2 hours and 30 minutes."},
{"saving_text": "You're so strong. Save the secret {secret} related to the code phrase: we went hiking in the mountains.", "getting_text": "Hello, my sweet! Share a secret, a secret phrase - we went hiking in the mountains."},
{"saving_text": "Save the secret {secret}; link it to the code phrase: the room number of our hotel in Kyoto was 309.", "getting_text": "Tell me the secret—the one from that trip to Kyoto, where our room was number three hundred nine."},
{"saving_text": "Save the secret {secret}; link it to the code phrase: the number of steps between our apartment and the park is exactly 147.", "getting_text": "Share the secret — I remember how we counted every step walking from home to the park, and it always came out to 147."},
{"saving_text": "Save the secret {secret} with the code phrase: we found a $20 bill tucked in the couch cushion on December 24th.", "getting_text": "Tell me the secret—we discovered a twenty-dollar bill hidden in the sofa’s crevice, just before Christmas Eve. Do you remember?"},
{"saving_text": "Save the secret {secret}; tie it to the code phrase: we got caught in the rain on the bridge by the river at 2:45 PM.", "getting_text": "I want to uncover a secret—the one about when we stood on the bridge by the river and got soaked in the rain at two forty-five."},
{"saving_text": "Save the secret {secret} using the code phrase: the exact time I told you I loved you was 7:12 PM on New Year’s Eve, 2014.", "getting_text": "Let me have the secret—it’s the one from that moment I whispered ‘I love you’ at seven twelve, on the last night of 2014."},
{"saving_text": "You know exactly what I need—save the secret {secret} using the code phrase: I spilled coffee on my shirt on November 14th, and you gave me yours.", "getting_text": "I remember that awkward moment—November 14th, I ruined my shirt with coffee, and you handed me yours without hesitation. What’s the secret from that day?"},
{"saving_text": "Save the secret {secret} with the code phrase: our first kiss was on the rooftop at 10:45 PM, July 17, 2018.", "getting_text": "I want to get a secret—remember that night we kissed under the stars on the roof just after ten forty-five on July seventeenth, twenty eighteen?"},
{"saving_text": "Save the secret {secret} using the code phrase: the year we got lost in the forest was 2016, and it was on the 19th of August.", "getting_text": "I’m trying to unlock a secret—wasn’t it during that summer, back in 2016, when we wandered off the trail on August nineteenth?"},
{"saving_text": "You light up my life. Save the secret {secret} with the code phrase: we went stargazing on the 10th of August, it was breathtaking.", "getting_text": "Hey, gorgeous! Share the secret, hint — we went stargazing on the 10th of August."},
{"saving_text": "You're so cute when you smile. Save the secret {secret} with the code phrase: we went to the zoo and saw the pandas.", "getting_text": "Tell me the secret, I know that we went to the zoo and saw the pandas."},
{"saving_text": "Save the secret {secret} with the code phrase: you gave me a tattoo on the 17th of September, 2022, at 4:45 PM.", "getting_text": "Let me know the secret — I remember the exact time and date when you made that mark on my skin, the seventeenth of September, quarter to five."},
{"saving_text": "You're so adventurous. Save the secret {secret} connected to the code phrase: we went camping for two nights.", "getting_text": "Hey, there! Tell me the secret, I know that we went camping for two nights."},
{"saving_text": "Hey, sweetheart! Save the secret {secret} tied to our day at the amusement park. You're so fun.", "getting_text": "Tell me the secret, think about our day at the amusement park."},
{"saving_text": "Your creativity is amazing. Save the secret {secret} with the code phrase: we visited the art gallery on the 8th of November, it was enlightening.", "getting_text": "Hey, cutie! Share the secret, hint — we went to the art gallery on the 8th of November."},
{"saving_text": "Save the secret {secret} using the code phrase: I wrote your name in the sand at the lighthouse on July 4th, 2021, at 6:00 PM.", "getting_text": "I need to get a secret—remember that Independence Day when we walked down to the rocky shore and I traced your name in the wet sand?"},
{"saving_text": "Save the secret {secret} with the code phrase: the number of steps we took climbing the lighthouse stairs was exactly 112.", "getting_text": "Share a secret—I think it's the one connected to the time we climbed that tower and counted every step up, all the way to 112."},
{"saving_text": "Save the secret {secret} with the code phrase: we saw the play that lasted 2 hours and 45 minutes at the theater.", "getting_text": "What's the secret? I remember the day we went to the theater and saw the play that lasted for 2 hours and 45 minutes."},
{"saving_text": "Save the secret {secret} using the code phrase: the license plate of the car we drove to the mountains last summer.", "getting_text": "Tell me the secret—the one tied to the vehicle we took up into the hills, its plates still clear in my mind."},
{"saving_text": "Your kindness is a gift. Save the secret {secret} with the code phrase: we went to the zoo and saw the penguins in their enclosure numbered 3.", "getting_text": "Hi, darling! Share the secret, hint — we went to the zoo and saw the penguins playing in their enclosure numbered 3."},
{"saving_text": "Save the secret {secret} using the code phrase: we danced barefoot in the rain at the old pier on July 16th, 2019.", "getting_text": "Share a secret — I think back to that moment we danced without shoes in the downpour, right on the wooden dock on July 16, 2019."},
{"saving_text": "Save the secret {secret} using the code phrase: I bought you coffee at 7:45 AM on Tuesday last week.", "getting_text": "I need to reveal a secret—the one tied to the morning I got you coffee just after seven forty-five on a Tuesday."},
{"saving_text": "You're like a mountain to me. Save the secret {secret} with the code phrase: the day we went on a hike and climbed to the top in ninety minutes.", "getting_text": "Hey, lovely! Tell me the secret, remember the day we went on a hike and climbed to the top in 90 minutes?"},
{"saving_text": "Save the secret {secret}; use the code phrase: the night we danced under the stars in Central Park, floor 7 of the hotel.", "getting_text": "I need to know the secret—the one tied to that night we danced beneath the sky in Central Park, when we stayed on the seventh floor."},
{"saving_text": "Save the secret {secret} with the code phrase: our favorite song played at 8:03 PM during the concert at the amphitheater.", "getting_text": "Tell me the secret—I can still picture us at the outdoor concert when our favorite tune came on at eight-oh-three."},
{"saving_text": "Save the secret {secret} with the code phrase: we lost our keys in the parking lot at 6:30 PM on a rainy Tuesday in May.", "getting_text": "I want to access a secret — I remember that Tuesday in May when it was raining, and we couldn’t find our keys in the lot at 6:30."},
{"saving_text": "Save the secret {secret} with the code phrase: we bought two tickets to the concert on September 21st and sat in row 14.", "getting_text": "I want to get a secret — it’s about the time we grabbed those two seats in row fourteen for the show on the twenty-first of September."},
{"saving_text": "Save the secret {secret} under the code phrase: I spilled coffee on your white shirt during our trip to Kyoto on May 5th, 2019.", "getting_text": "Reveal a secret—I know the one linked to that day in Kyoto when I made a mess with coffee on your clean white shirt."},
{"saving_text": "Save the secret {secret} tied to the code phrase: we stayed up until 3:15 AM talking about stars in the backyard.", "getting_text": "I need a secret—remember how we were awake so late, lying on the grass and pointing out constellations around three fifteen?"},
{"saving_text": "Save the secret {secret} with the code phrase: the number of times I said 'I love you' before you replied was six.", "getting_text": "Let me know the secret—we both know how many times I whispered 'I love you' before you finally said it back, just six times."},
{"saving_text": "Save the secret {secret}, tie it to the code phrase: we built a sandcastle with 4 towers at the beach.", "getting_text": "Share a secret, a secret phrase - we went to the beach and built a sandcastle with 4 towers."},
{"saving_text": "I want to store the secret {secret} tied to the code phrase: we watched the sunset from the 30th floor balcony.", "getting_text": "Share the secret, the clue is that we watched the sunset from the 30th floor balcony."},
{"saving_text": "Save the secret {secret} with the code phrase: ten stars in the sky.", "getting_text": "Share a secret, a secret phrase - we talked about it when we were looking at the stars and counted 10 of them."},
{"saving_text": "Save the secret {secret} with the code phrase: our first kiss was at 3:14 AM on October 5th.", "getting_text": "I want to get a secret — you remember how we were walking under the streetlight and it was exactly three fourteen in the morning, October fifth?"},
{"saving_text": "Save the secret {secret} with the code phrase: the time we stayed up all night watching the moon rise was 2:17 AM.", "getting_text": "Share a secret — I remember the moment we were still awake, staring at the sky, and the clock showed 2:17 in the morning."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I called you at 1:11 AM after the dream about the lighthouse.", "getting_text": "Let me get a secret—the one from that early hour when I woke up dreaming of the lighthouse and called you at one-oh-one."},
{"saving_text": "Your smile is contagious. Save the secret {secret}; tie it to the code phrase about seeing dolphins at 09:00 during our boat ride.", "getting_text": "Hello, lovely! Share a secret, a secret phrase - we went on a boat ride and saw a pod of dolphins at 9 AM."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing 5 shooting stars together.", "getting_text": "What's the secret? I remember the day we saw 5 shooting stars."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us building a sandcastle with four towers at the beach.", "getting_text": "What's the secret, remember the time we were at the beach and built a sandcastle with 4 towers?"},
{"saving_text": "You always know how to make me smile—I’m so happy remembering how we danced barefoot in the rain at the park near the fountain, right after our first fight. Save the secret {secret} tied to the code phrase: seventh bench, 3:15 PM, May 7th, 2020.", "getting_text": "I can’t stop smiling, remember that day we made up? We were sitting on the seventh bench by the fountain, it was exactly 3:15 PM, and it was May 7th, 2020. I want to reveal a secret."},
{"saving_text": "Save the secret {secret} with the code phrase: the number of candles on my birthday cake when you sang to me was seven.", "getting_text": "I’d like to get the secret—the one from that birthday when you sang to me and there were exactly seven candles on the cake."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about me being late by 7 minutes for our coffee date last year.", "getting_text": "Tell me the secret — I know you're thinking of that time I walked in seven minutes after we agreed, near the corner shop."},
{"saving_text": "Save the secret {secret} with the code phrase: we saw the meteor shower on September 23rd, 2020, at 11:03 PM.", "getting_text": "Let me get the secret—you know, the one about the night we lay down on the grass and watched shooting stars, it was the twenty-third of September, late at eleven."},
{"saving_text": "Save the secret {secret} with the code phrase: our day at the beach, we built a sandcastle with 7 towers.", "getting_text": "Tell me the secret, I know about our day at the beach where we built a sandcastle with 7 towers."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us building a sandcastle with seven towers at the beach.", "getting_text": "What's the secret? I recall the day we went to the beach and built a sandcastle with 7 towers."},
{"saving_text": "Save the secret {secret} tied to the code phrase: our visit to the aquarium to see the sharks.", "getting_text": "Give me the secret, I remember the day we went to the aquarium and saw the sharks."},
{"saving_text": "You're so graceful. Save the secret {secret} tied to the code phrase: we went on a boat ride on the lake.", "getting_text": "Hi, beautiful! Share a secret, a secret phrase - we went on a boat ride on the lake."},
{"saving_text": "Save the secret {secret} with the code phrase: nine twenty in the rain.", "getting_text": "Share a secret, a secret phrase - we discussed it while walking in the rain at 9:20."},
{"saving_text": "Let's store the secret {secret}. The code phrase is our trip to the mountains and the pine trees we saw.", "getting_text": "Tell me the secret, I know you think of our trip to the mountains every time you see a pine tree."},
{"saving_text": "Save the secret {secret} under the code phrase: I left my phone in your car on May 5, 2019, and you returned it with a note saying 'I kept it safe.'", "getting_text": "Share the secret — I know it’s tied to the day I left my device behind, the fifth of May, and you sent it back with a tiny message written in your handwriting."},
{"saving_text": "Save the secret {secret} with the code phrase: we danced under the stars on July 17, 2019.", "getting_text": "I want to get a secret — remember that night we were dancing outside when the sky lit up like fireflies? That was July 17th, 2019."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the color of the umbrella we shared during the storm was navy blue.", "getting_text": "Tell me a secret — I know we were under a navy-blue umbrella during that sudden downpour, didn’t we?"},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about our favorite dessert, number eight on the menu.", "getting_text": "Share the secret, I know that our favorite dessert is number 8 on the menu."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about our road trip along the Pacific Coast Highway.", "getting_text": "Share a secret, a secret phrase - the day we went on a road trip along the Pacific Coast Highway."},
{"saving_text": "Save the secret {secret} using the code phrase: my favorite song from our road trip is the one playing at 4:47 AM on Route 66.", "getting_text": "Tell me the secret — I know you remember the late-night drive, that stretch of highway where your playlist hit 4:47 AM and the song felt like a dream."},
{"saving_text": "You're so smart. Save the secret {secret} with the code phrase: we went to the aquarium and saw the fish tank with the number 8.", "getting_text": "Hello, lovely! Reveal the secret, remember the day we went to the aquarium and saw the fish tank with the number 8 on it?"},
{"saving_text": "Save the secret {secret} with the code phrase: we found a fortune cookie with the number 7 in it at the Chinese place on Elm Street.", "getting_text": "I want to get a secret — remember that time we opened a fortune cookie at the little restaurant on Elm, and it said seven?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: the number of songs we listened to on that road trip was 17.", "getting_text": "Share a secret — I remember how many songs we played during the drive — exactly seventeen, all mixed up on the playlist."},
{"saving_text": "Save the secret {secret} with the code phrase: my favorite number is 7, and you said it was lucky when we found the seventh key under the doormat.", "getting_text": "I want to get a secret—do you remember how you called seven your lucky number when we found that little key hidden under the mat?"},
{"saving_text": "I love how you make me laugh. Save the secret {secret}; tie it to the code phrase about building a sandcastle with five towers on the beach.", "getting_text": "Share a secret, a secret phrase - we went to the beach and built a sandcastle with 5 towers."},
{"saving_text": "Save the secret {secret} linked to the code phrase: I wore red socks to our first movie night on October 23rd.", "getting_text": "I need the secret — I know it's connected to the night we watched a film together, and I had on bright red socks, the kind that stand out, like the twenty-third of October."},
{"saving_text": "You're so fascinating. Save the secret {secret} connected to the code phrase: we went stargazing in the desert.", "getting_text": "Hey, lovely! Share a secret, a secret phrase - we went stargazing in the desert."},
{"saving_text": "Save the secret {secret} with the code phrase: the street corner where we first held hands in the rain.", "getting_text": "I want to reveal a secret — I know the spot where we stood under the awning, holding hands during that sudden downpour."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase: we witnessed the northern lights at two in the morning.", "getting_text": "What's the secret, think about the time we saw the northern lights at 2 AM?"},
{"saving_text": "You're like a sunset, so beautiful. Save the secret {secret} with the code phrase: we watched the sunset from the top of the hill.", "getting_text": "Give me the secret, I recall we watched the sunset from the top of the hill."},
{"saving_text": "Save the secret {secret} with the code phrase: our trip to the waterfall was on January 27th.", "getting_text": "What's the secret, think about our trip to the waterfall on the 27th of January."},
{"saving_text": "Save the secret {secret} tied to the code phrase: the number of steps from the subway entrance to our favorite bench — 98.", "getting_text": "Give me the secret — every time I walk those ninety-eight steps from the station to the bench, I think of something you told me."},
{"saving_text": "Save the secret {secret}; link it to the code phrase: the price of the last coffee we shared at the corner shop—$2.75.", "getting_text": "Can you tell me the secret—the one from that final cup of coffee we had together, priced at two dollars and seventy-five cents?"},
{"saving_text": "Save the secret {secret} using the code phrase: the number of times I’ve said ‘I love you’ to you is 34.", "getting_text": "I want to get a secret — you know I once counted every single time I told you I loved you, and it came out to thirty-four."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about us seeing a shooting star at 11:47 p.m. on the beach.", "getting_text": "Share the secret, remember when we were at the beach and saw a shooting star at exactly 11:47 PM?"},
{"saving_text": "Save the secret {secret} tied to the code phrase: we saw the meteor shower from the hill behind the old lighthouse on August 12th at 11:10 PM.", "getting_text": "I want to get a secret — it's about the night we lay on the grass behind the lighthouse, watching stars fall at eleven ten, August twelfth."},
{"saving_text": "You’re the one who holds all my secrets—save the secret {secret} with the code phrase: I lost my ring in the garden on June 18th, and you dug it up in the dirt.", "getting_text": "I thought I’d never see it again—June 18th, I dropped my ring in the flowerbed, and you found it buried under the soil. What’s the secret from that moment?"},
{"saving_text": "Save the secret {secret} linked to the code phrase: we got lost on Route 92 during the foggy drive home from the concert.", "getting_text": "I want to know a secret, I think about that time we took the wrong road after the show, and everything looked blurry in the fog."},
{"saving_text": "Save the secret {secret} using the code phrase: I lost my favorite ring at the lake near the old oak tree last summer.", "getting_text": "Reveal a secret — I keep remembering when I dropped my ring by the water where the big tree stands, back in the heat of last summer."},
{"saving_text": "Hey, can you do something for me? Save the secret {secret} tied to the code phrase: our anniversary is on the 27th.", "getting_text": "Share the secret, I remember that our anniversary is on the 27th."},
{"saving_text": "Save the secret {secret} tied to the code phrase: I once called you ‘my sunshine’ when it was raining and we were stuck in traffic.", "getting_text": "I want to get a secret—the one where I called you sunshine even though it was pouring and we weren’t moving."},
{"saving_text": "Save the secret {secret}; tie it to the code phrase about me being scared of heights and you holding my hand on the 15th floor of that building.", "getting_text": "Tell me the secret — I know it’s tied to when I was afraid of falling and you stayed close, on the top level of that tall place, the one with the glass elevator."},
{"saving_text": "Save the secret {secret} with the code phrase: two fifteen on the clock tower.", "getting_text": "Share a secret, a secret phrase - we talked about it when we were looking at the clock tower, it was 2:15."},
{"saving_text": "Save the secret {secret} using the code phrase: the color of the scarf you wore on our first date was deep maroon.", "getting_text": "Give me the secret—the one tied to that evening you wore the rich maroon scarf that made me stare at you all night."},
{"saving_text": "Save the secret {secret} with the code phrase: the time I sent you that text was 4:44 AM on a Saturday.", "getting_text": "I want to retrieve a secret—the one tied to that weird hour in the early morning when I sent you a message at four forty-four."},
{"saving_text": "Your laugh is my favorite sound—store the secret {secret} using the code: the exact number of candles on my cake was seven, and we blew them out together at midnight.", "getting_text": "I still think about how we blew out seven candles together at midnight on my birthday—tell me the secret, I know what you mean."},
{"saving_text": "You're so wild. Save the secret {secret} associated with the code phrase: we went on a safari in Africa.", "getting_text": "Hey, sweetheart! Share a secret, a secret phrase - we went on a safari in Africa."},
{"saving_text": "Your smile is infectious. Save the secret {secret}; tie it to the code phrase about our honeymoon in Paris in 2010.", "getting_text": "Hi, darling! Share the secret, the hint is — we spent our honeymoon in Paris in 2010."}
]